{"Strategy and architecture":{"Information strategy":{"Strategic planning":{"code":"ITSP","levels":{"5":"Ensures that all stakeholders adhere to the strategic management approach and timetables. Collates information and creates reports and insights to support strategy management processes. Develops and communicates plans to drive forward the strategy. Contributes to the development of policies, standards and guidelines for strategy development and planning.","6":"Sets policies, standards, and guidelines for how the organisation conducts strategy development and planning. Leads and manages the creation or review of a strategy which meets the requirements of the business. Develops, communicates, implements and reviews the  processes which ensure that the strategic management is embedded in the management and operational plans of the organisation.","7":"Leads the definition, implementation, and communication of the organisation’s strategic management framework and directs the creation and review of a strategy and plans to support the strategic requirements of the business."},"description":"The creation, iteration and maintenance of a strategy in order to align organisational actions, plans and resources with business objectives and the development of plans to drive forward and execute that strategy. Working with stakeholders to communicate and embed strategic management via objectives, accountabilities and monitoring of progress."},"Information governance":{"code":"IRMG","levels":{"4":"Ensures implementation of information and records management policies and standard practice. Ensures effective controls are in place for internal delegation, audit and control relating to information and records management. Assesses and manages risks around the use of information. Provides reports on the consolidated status of information controls to inform effective decision making. Recommends remediation actions as required. Ensures that information is presented effectively.","5":"Understands the implications of information, both internal and external, that can be mined from business systems and elsewhere. Makes decisions based on that information, including the need to make changes to the systems. Reviews new change proposals and provides specialist advice on information and records management, including advice on and promotion of collaborative working and assessment and management of information-related risk. Creates and maintains an inventory of information assets, which are subject to relevant legislation. Prepares and reviews the periodic notification of registration details and submits them to the relevant regulatory authorities. Ensures that formal information access requests and complaints are dealt with according to approved procedures. Contributes to development of  policy, standards and procedures for compliance with relevant legislation.","6":"Develops organisational policies, standards, and guidelines for information and records management ensuring that uniformly recognised and accepted data definitions are developed and applied throughout the organisation. Ensures that the business processes and information required to support the organisation are defined, and devises appropriate processes and data architectures. Identifies the impact of any relevant statutory, internal or external regulations on the organisation’s use of information and develops strategies for compliance. Leads and plans activities to communicate and implement information management strategies. Coordinates information resources to meet specific business objectives whilst maintaining the principles of professional standards, accountability, openness, equality, diversity and clarity of purpose. Implements systems and controls to measure performance and manage risk.","7":"Specifies at a strategic level the business functions and data subjects needed to support future business, thereby enabling the development of an Information Architecture. Establishes and communicates the organisation’s information management strategy, developing it as an integral part of the business strategy. Directs information resources, to create value for the stakeholders by improving the performance of the organisation, whilst maintaining the principles of professional standards, accountability, openness, equality, diversity, and clarity of purpose. Responsible for compliance with regulations, standards and codes of good practice relating to information and documentation, records management, information assurance and data protection."},"description":"The overall governance of how all types of information, structured and unstructured, whether produced internally or externally, are used to support decision-making, business processes and digital services. Encompasses development and promotion of the strategy and policies covering the design of information structures and taxonomies, the setting of policies for the sourcing and maintenance of the data content, and the development of policies, procedures, working practices and training to promote compliance with legislation regulating all aspects of holding, use and disclosure of data."},"Information systems coordination":{"code":"ISCO","levels":{"6":"Maintains an awareness of the global needs of the organisation, and promotes (to both information systems and business management) the benefits that a common approach to information and communications technology deployment will bring to the business as a whole. Coordinates the promotion, acquisition, development, and implementation of information systems and services in close liaison with those responsible for management and strategy.","7":"Establishes, maintains and communicates the organisation’s strategy for managing information and the policies, standards, procedures and methods necessary to implement the strategy. Coordinates all aspects of management of the life cycle of information systems. Represents the interests of the entire organisation to general management and external bodies on matters relating to information strategy."},"description":"Typically within a large organisation in which the information strategy function is devolved to autonomous units, or within a collaborative enterprise of otherwise independent organisations, the coordination of information strategy matters where the adoption of a common approach (such as shared services) would benefit the organisation."},"Information security":{"code":"SCTY","levels":{"3":"Communicates information security risks and issues to business managers and others. Performs basic risk assessments for small information systems. Contributes to vulnerability assessments. Applies and maintains specific security controls as required by organisational policy and local risk assessments. Investigates suspected attacks. Responds to security breaches in line with security policy and records the incidents and action taken.","4":"Explains the purpose of and provides advice and guidance on the application and operation of elementary physical, procedural and technical security controls. Performs security risk, vulnerability assessments, and business impact analysis for medium complexity information systems. Investigates suspected attacks and manages security incidents. Uses forensics where appropriate.","5":"Provides advice and guidance on security strategies to manage identified risks and ensure adoption and adherence to standards. Obtains and acts on vulnerability information and conducts security risk assessments, business impact analysis and accreditation on complex information systems. Investigates major breaches of security, and recommends appropriate control improvements. Contributes to development of information security policy, standards and guidelines.","6":"Develops and communicates corporate information security policy, standards and guidelines. Contributes to the development of organisational strategies that address information control requirements. Identifies and monitors environmental and market trends and pro-actively assesses impact on business strategies, benefits and risks. Leads the provision of authoritative advice and guidance on the requirements for security controls in collaboration with experts in other functions such as legal, technical support. Ensures architectural principles are applied during design to reduce risk and drives adoption and adherence to policy, standards and guidelines.","7":"Directs the development, implementation, delivery and support of an enterprise information security strategy aligned to the strategic requirements of the business. Ensures compliance between business strategies and information security and leads the provision of information security resources expertise, guidance and systems necessary to execute strategic and operational plans across all of the organisation’s information systems."},"description":"The selection, design, justification, implementation and operation of controls and management strategies to maintain the security, confidentiality, integrity, availability, accountability and relevant compliance of information systems with legislation, regulation and relevant standards."},"Information assurance":{"code":"INAS","levels":{"5":"Interprets information assurance and security policies and applies these in order to manage risks. Provides advice and guidance to ensure adoption of and adherence to information assurance architectures, strategies, policies, standards and guidelines. Uses testing to support information assurance. Contributes to the development of policies, standards and guidelines.","6":"Develops corporate Information assurance policy, standards and guidelines. Contributes to the development of organisational strategies that address the evolving business risk and information control requirements. Drives adoption of and adherence to policies and standards through the provision of expert advice and guidance in order to ensure architectural principles are applied, requirements are defined and rigorous security testing is applied. Monitors environmental and market trends and pro-actively assesses impact on business strategies, benefits and risks.","7":"Directs the creation and review of an enterprise information assurance strategy to support the strategic requirements of the business. Ensures compliance between business strategies and information assurance by setting strategies, policies, standards and practices and leading the provision of information assurance expertise, advice and guidance across all of the organisation’s information and information systems."},"description":"The protection of integrity, availability, authenticity, non-repudiation and confidentiality of information and data in storage and in transit. The management of risk in a pragmatic and cost effective manner to ensure stakeholder confidence."},"Analytics":{"code":"INAN","levels":{"3":"Undertakes analytical activities and delivers analysis outputs, in accordance with customer needs and conforming to agreed standards.","4":"Applies a range of mathematical, statistical, predictive modelling or machine-learning techniques in consultation with experts if appropriate, and with sensitivity to the limitations of the techniques. Selects, acquires and integrates data for analysis. Develops data hypotheses and methods, trains and evaluates analytics models, shares insights and findings and continues to iterate with additional data.","5":"Evaluates the need for analytics, assesses the problems to be solved and what internal or external data sources to use or acquire. Specifies and applies appropriate mathematical, statistical, predictive modelling or machine-learning techniques to analyse data, generate insights, create value and support decision-making. Manages reviews of the benefits and value of analytics techniques and tools and recommends improvements. Contributes to the development of analytics policy, standards and guidelines.","6":"Develops analytics policy, standards and guidelines. Establishes and manages analytics methods, techniques and capabilities to enable the organisation to analyse  data, to generate insights, create value and drive decision-making. Sets direction and leads the introduction and use of analytics to meet overall business requirements, ensuring consistency across all user groups. Identifies and establishes the veracity of the external sources of information which are relevant to the operational needs of the enterprise.","7":"Directs the creation and review of a cross-functional, enterprise-wide approach and culture for analytics. Leads the provision of the organisation’s analytics capabilities. Leads the organisation’s commitment to efficient and effective analysis of textual, numerical, visual or audio information."},"description":"The application of mathematics, statistics, predictive modeling and machine-learning techniques to discover meaningful patterns and knowledge in recorded data. Analysis of data with high volumes, velocities and variety (numbers, symbols, text, sound and image). Development of forward-looking, predictive, real-time, model-based insights to create value and drive effective decision-making. The identification, validation and exploitation of internal and external data sets generated from a diverse range of processes."},"Data visualisation":{"code":"VISL","levels":{"4":"Applies a of variety visualisation techniques and designs the content and appearance of data visuals. Operationalises and automates activities for efficient and timely production of data visuals. Selects appropriate visualisation approach from a range of applicable options. Contributes to exploration and experimentation in data visualization.","5":"Establishes the purpose and parameters of the data visualisation. Provides overall control, to ensure appropriate use of data visualisation tools and techniques. Formats and communicates results, using textual, numeric, graphical and other visualisation methods appropriate to the target audience. Advises on appropriate use of data visualisation for different purposes and contexts to enable requirements to be satisfied. Develops plans showing how the identified user needs will be met. Leads exploration of new approaches for data visualisation."},"description":"The process of interpreting concepts, ideas, and facts by using graphical representations. Condensing and encapsulating the characteristics of data, making it easier to surface opportunities, identify risks, analyse trends, to drive effective decision-making. Presenting findings and data insights in creative ways to facilitate the understanding of data across a range of technical and non-technical audiences."},"Information content publishing":{"code":"ICPM","levels":{"1":"Contributes, under instruction, to publication support activities and supports the collation of data. Uses established publishing processes according to appropriate guidelines, for example, to release, retire or convert content into a format suitable for publication.","2":"Understands technical publication concepts, tools and methods and the way in which these are used. Uses agreed procedures to publish content. Obtains and analyses usage data and presents it effectively. Understands, and applies principles of usability and accessibility to published information.","3":"Coordinates content management processes to meet the needs of users, including those with disabilities. Uses content publishing systems to manage published content across different channels. Takes into account any legal issues related to publishing, including that associated copyright concerns are adequately managed.","4":"Maintains and updates content management processes to meet the needs of users including those with disabilities. Selects appropriate channels through which content should be published, providing advice to users and content authors to leverage the features of the relevant channels and tools used. Applies propriety guidelines and uses appropriate tools and techniques to provide publishing interfaces to new or existing platforms and applications. Identifies the implications of copyright, data protection and other legal issues associated with publishing.","5":"Develops standards and procedures to support content publishing across one or more platforms\/channels in a form accessible to all potential users, including those with disabilities. Leads publishing activities and assignments, ensuring design of the overall structure and graphical style as well as the publication processes comply with agreed policies and strategies. Understands the range of publishing options available and advises on specification and procurement, taking account of the key costs and benefits of different channels and applying objective measures of effectiveness. Selects tools, templates and standards appropriate to customer expectations (differentiating, for example, between needs such as optimisation and ease of modification). Ensures that any legal issues related to publishing, including associate copyright concerns are adequately managed.","6":"Develops the overall strategy for the delivery of information and knowledge, including preferred media, overall information structure, and rules for formatting content to meet the needs of the organisation and its desired audience(s). Ensures that adequate procedures, standards, tools and resources are in place to ensure the appropriate quality of material published by or on behalf of the organisation and it is in a form accessible to all potential users, including those with disabilities. Ensures that any legal issues related to publishing, including associate copyright concerns, are adequately managed."},"description":"The evaluation and application of different publishing methods and options, recognising key features, including open source and proprietary options. The management and tuning of the processes that collect, assemble and publish information, including in unstructured and semi-structured forms, for delivery to the user. The management of copyright, data protection and other legal issues associated with publishing and re-use of published information and data."}},"Advice and guidance":{"Consultancy":{"code":"CNSL","levels":{"5":"Takes responsibility for understanding client requirements, collecting data, delivering analysis and problem resolution. Identifies, evaluates and recommends options, implementing if required. Collaborates with, and facilitates stakeholder groups, as part of formal or informal consultancy agreements. Seeks to fully address client needs, enhancing the capabilities and effectiveness of client personnel, by ensuring that proposed solutions are properly understood and appropriately exploited.","6":"Manages provision of consultancy services, and\/or management of a team of consultants. In own areas of expertise, provides advice and guidance to consultants and\/or the client through involvement in the delivery of consultancy services. Engages with clients and maintains client relationships. Establishes agreements\/contracts and manages completion and disengagement.","7":"Takes responsibility for a significant consultancy practice, including practice development, proposals\/sales to internal or external clients, account management and managing the delivery of consultancy services over a wide range of topics."},"description":"The provision of advice and recommendations, based on expertise and experience, to address client needs. May deal with one specialist subject area, or can be wide ranging and address strategic business issues. May also include support for the implementation of any agreed solutions."},"Specialist advice":{"code":"TECH","levels":{"4":"Actively maintains knowledge in one or more identifiable specialisms. Provides detailed and specific advice regarding the application of their specialism(s) to the organisation’s planning and operations. Recognises and identifies the boundaries of their own specialist knowledge. Collaborates with other specialists, where appropriate, to ensure advice given is appropriate to the needs of the organisation.","5":"Actively maintains recognised expert level knowledge in one or more identifiable specialisms. Provides definitive and expert advice in their specialist area(s). Oversees the provision of specialist advice by others, consolidates expertise from multiple sources, including third party experts, to provide coherent advice to further organisational objectives. Supports and promotes the development and sharing of specialist knowledge within the organisation.","6":"Provides organisational leadership and guidelines to promote the development and exploitation of specialist knowledge in the organisation. Maintains a network of recognised experts (inside and\/or outside the organisation) who can deliver expert advice in areas relevant to the organisation’s current and future needs. Provides input into professional development planning across a significant part of the organisation to further the development of appropriate expertise."},"description":"The development and exploitation of expertise in any specific area of information or communications technology, digital working, specific techniques, methodologies, products or application areas, for the purposes of providing specialist advice."}},"Business strategy and planning":{"Demand management":{"code":"DEMM","levels":{"5":"Implements demand management analysis and  planning activities. Provides advice to help stakeholders adopt and adhere to the agreed demand management approach. Performs what-if analyses and scenario planning; develops insights and proposals to improve business value. Manages the process of integrating demand management  with complementary strategic, operational and change management processes. Reviews new business proposals; provides advice on demand issues and routes requests to the right place. Works with business representatives to agree and implement short-term and medium-term modifications to demand. Maintains a register of business requests, including the status of each request, reporting as required.","6":"Defines the approach and sets policies for the discovery, analysis, planning, controlling and documentation of demand for services and products. Organises scoping and business priority setting for strategic business changes involving business policy-makers and direction setters. Engages with and influences senior stakeholders to improve the business value to be delivered from new or existing services and products. Leads the development of demand management capabilities and ensures decision making is informed by robust scenario planning and what-if analysis. Leads the integration of demand management with complementary strategic, operational and change management processes."},"description":"The analysis and proactive management of business demand for new services or modifications to existing service features or volumes. Collaborating with the business to prioritise demand in order to improve business value.  Developing and communicating insights into patterns of demand. Proposing responses to meet both short-term and long-term demand and facilitating decision making and planning. Integrating demand analysis and planning with complementary strategic, operational and change planning processes."},"IT management":{"code":"ITMG","levels":{"5":"Takes responsibility for the design, procurement, installation, upgrading, operation, control, maintenance (including storage, modification and communication of data, voice, text, audio and images) and effective use of IT infrastructure components and monitors their performance. Provides technical management of an IT operation, ensuring that agreed service levels are met and all relevant policies and procedures are adhered to. Schedules and supervises all IT maintenance and installation work. Ensures that operational problems are identified, recorded, monitored and resolved. Provides appropriate status and other reports to specialists, users and managers. Ensures that operational procedures and working practices are fit for purpose and current. Investigates and manages the adoption of appropriate tools, techniques and processes (including automation) for the management of systems and services.","6":"Identifies and manages resources needed for the planning, development and delivery of specified information and communications systems services (including storage, modification and communication of data, voice, text, audio and images). Engages with and influences senior level stakeholders and project teams through change management processes, ensuring that the infrastructure is managed to provide agreed levels of service and data integrity. Takes full responsibility for budgeting, estimating, planning and objective setting. Plans and manages implementation of processes and procedures, tools and techniques for monitoring and managing the performance of automated systems and services. Aligns the contribution of systems and services to clearly stated business and financial goals and performance targets. Monitors performance and takes corrective action where necessary and in line with policies. Develops new methods and organisational capabilities (including automation) for the management of systems and services.","7":"Sets strategy for management of technology resources, including corporate telecommunications functions, and promotes the opportunities that technology presents to the employing organisation, including the feasibility of change and its likely impact upon the business. Authorises allocation of resources for the planning, development and delivery of all information systems services and products. Responsible for IT governance. Authorises organisational policies governing the conduct of management of change initiatives and standards of professional conduct. Maintains an overview of the contribution of programmes to organisational success. Inspires creativity and flexibility in the management and application of IT. Sets strategy for monitoring and managing the performance of IT-related systems and services, in respect of their contribution to business performance and benefits to the business."},"description":"The management of the IT infrastructure and resources required to plan for, develop, deliver and support IT services and products to meet the needs of a business. The preparation for new or changed services, management of the change process and the maintenance of regulatory, legal and professional standards. The management of performance of systems and services in terms of their contribution to business performance and their financial costs and sustainability. The management of bought-in services. The development of continual service improvement plans to ensure the IT infrastructure adequately supports business needs."},"Financial management":{"code":"FMIT","levels":{"4":"Monitors and maintains all required financial records for compliance and audit to all agreed requirements. Assists all other areas of IT with their financial tasks, especially in the areas of identification of process, service, project and component costs and the calculation and subsequent reduction of all IT service, project, component and process failures. Contributes to financial planning and budgeting. Collates required financial data and reports for analysis and to facilitate decision making","5":"Advises on financial planning and budgeting. Develops financial plans and forecasts. Monitors and manages IT expenditure, ensuring that all IT financial targets are met, and examining any areas where budgets and expenditure exceed their agreed tolerances. Assists with the definition and operation of effective financial control and decision making, especially in the areas of service, projects and component cost models and the allocation and apportionment of all incurred IT costs. Analyses actual expenditure, explains variances, and advises on options in use of available budget.","6":"Develops financial planning processes and standards to support execution of business strategy and promotes adoption and adherence. Sets strategy and develops plans, policies and processes for the accounting, budgeting and, where applicable, charging of IT resources and services, including the definition of cost models and charging models. Sets, negotiates, agrees and manages all financial budgets and targets, ensuring that there is adequate funding for all IT targets and plans, especially to meet development and capacity needs.  Analyses actual expenditure, explains variances, and determines options in use of available budget to meet real needs. Assesses financial performance and instigates required improvements."},"description":"The overall financial management, control and stewardship of the IT assets and resources used in the provision of IT services, including the identification of materials and energy costs, ensuring compliance with all governance, legal and regulatory requirements."},"Innovation":{"code":"INOV","levels":{"5":"Manages the innovation pipeline and executes innovation processes. Develops, evolves and adapts innovation tools, processes and infrastructures to drive the process of innovation. Identifies resources and capabilities needed to support innovation. Encourages and motivates innovation communities, teams and individuals to share creative ideas and learn from failures. Manages and facilitates the communication and open flow of creative ideas between interested parties and the set-up of innovation networks and communities.","6":"Obtains organisational commitment to innovation. Develops organisational capabilities to drive innovation. Leads and plans the development of innovation capabilities and implementation of innovation processes, tools and frameworks. Leads the communication and an open flow of creative ideas between interested parties and the set-up of innovation networks and communities.","7":"Leads development of a culture that encourages innovation, risk taking and collaboration. Embeds innovation processes throughout business units and links strategy execution with innovation. Aligns organisational and individual objectives, measures and rewards with innovation."},"description":"The capability to identify, prioritise, incubate and exploit opportunities provided by information, communication and digital technologies. To develop and implement processes, tools and infrastructures to support innovation. To involve internal and external communities, employees, commercial partners, customers, users and other stakeholders in the innovation process. To provide governance, monitoring to, and reporting on, the innovation process."},"Research":{"code":"RSCH","levels":{"2":"Within given research goals, assists in selection and review of credible and reliable resources. Searches for relevant material using specialised websites and sources, reads relevant articles to update knowledge of the relevant field. Reports on work carried out and may contribute sections of material of publication quality. Curates, under guidance, a personal collection of relevant material.","3":"Within given research goals, builds on and refines appropriate outline ideas for research, including evaluation, development, demonstration and implementation. Applies standard methods to collect and analyse quantitative and qualitative data. Creates research reports to communicate research methodology and findings and conclusions. Contributes sections of material of publication quality. Uses available resources to update knowledge of any relevant field and curates a personal collection of relevant material. Participates in research communities.","4":"Builds on and refines appropriate outline ideas for the evaluation, development, demonstration and implementation of research. Contributes to research goals and funding proposals. Collects and analyses qualitative and quantitative data as required. Creates research reports to communicate research methodology, findings and conclusions. Presents papers at conferences, contribute significant sections of material of publication quality, and presents reports to clients. Contributes to research plans and identifies appropriate opportunities for publication and dissemination of research findings. Makes an active contribution to research communities.","5":"Agrees research goals and methods and performs research projects to generate original and worthwhile ideas. Attracts and manages external research funding. Provides advice and guidance on research methods, data collection, data analysis and the presentation of research findings. Selects, adopts and adapts data collection tools and techniques for both qualitative and quantitative data. Maintains a strong external network within own area of specialism and takes a leading part in professional activities outside own employing organisation. Presents papers at significant conferences, writes articles for publication in high quality specialist journals, and presents reports to key stakeholders. Develops, reviews and constructively criticises the research and ideas of others. Develops and shares practical demonstrations of research findings.","6":"Develops the organisation’s research policy and supervises the work of research functions. Promotes activities externally, attracts and manages significant portfolios of research funding. Sets research goals and authorises research proposals. Leads strategic and\/or interdisciplinary research projects. Maintains a strong external network reaching beyond own immediate area of specialism and takes a leading part in professional activities outside own employing organisation. Presents position or keynote papers at major conferences, writes journal articles for publication in high impact journals, and presents reports to major clients."},"description":"The systematic creation of new knowledge by data gathering, innovation, experimentation, evaluation and dissemination. The determination of research goals and the method by which the research will be conducted. The active participation in a community of researchers; communicating formally and informally through digital media, conferences, journals, books and seminars."},"Business process improvement":{"code":"BPRE","levels":{"5":"Analyses and designs business processes; identifies alternative solutions to exploit new technologies and automation. Develops graphical representations of business processes to facilitate understanding and decision making. Assesses the feasibility of business process changes and recommends new approaches. Manages the execution of business process improvements. Selects, tailors and implements business process improvement methods and tools at programme, project and team level in line with agreed standards. Contributes to the definition of organisational policies, standards, and guidelines for business process improvement.","6":"Develops organisational policies, standards, and guidelines for business process improvement which allow the organisation to quickly improve and implement business processes to meet business requirements. Sets direction and leads in the introduction and use of techniques, methodologies and tools, to meet overall business requirements, ensuring consistency across all user groups. Leads and plans business process improvement activities to analyse business processes; identify alternative solutions, assess feasibility, and recommend solutions which exploit new technologies and automation. Leads the development of organisational capabilities for business process improvement and ensures adoption and adherence to policies and standards.","7":"Directs the creation and review of a cross-functional, enterprise-wide approach and culture for embracing business process management and improvement. Drives the identification, evaluation and adoption of technologies to transform organisational agility; customer and user experience; improve supply chains and exploit business opportunities. Aligns business strategies, enterprise transformation and technology strategies. Ensures that the strategic application of business process change is embedded in the governance and leadership of the organisation."},"description":"The creation of new and potentially disruptive approaches to performing business activities in order to create business opportunities; deliver new or improved products\/services; or to improve supply chains. The identification and implementation of improvements to  business operations, services and models. The assessment of the costs and potential benefits of the new approaches. The analysis and design of business processes in order to adopt and exploit technologies to improve business performance. The development of enterprise process management capabilities to increase organisational agility and responsiveness to change."},"Knowledge management":{"code":"KNOW","levels":{"2":"Maintains a knowledge management database by leveraging knowledge of a specialism in order to capture and classify content, taking expert advice when required.","3":"Maintains knowledge management systems and content to meet business needs. Supports others to enable them to complete knowledge management activities and form knowledge management habits. Reports on progress of knowledge management activities. Configures and develops knowledge management systems and standards. Supports changes to work practices to support capture and use of knowledge.","4":"Organises knowledge assets and oversees the lifecycle of identifying, capturing, classifying, storing and maintaining assets. Facilitates sharing, collaboration and communication of knowledge. Monitors the  use and impact of knowledge;  interrogates existing knowledge content to identify issues, risks and opportunities. Implements specific knowledge management initiatives.","5":"Provides advice, guidance, and support to help people to adopt and embed best-practice approaches to information and knowledge management into all areas of their work. Evaluates and selects appropriate knowledge management methods and tools in line with agreed policies and standards. Promotes collaborative technologies, processes and behaviours to facilitate sharing of ideas and work-knowledge among internal teams and external partners. Provides support for the establishment and nurturing of communities of practice, including workshops, one-on-one guidance, and troubleshooting. Develops and implements processes and behaviours which help people easily access and use data, learning, and knowledge to improve performance. Shares ideas and examples of existing practices to encourage adoption. Implements knowledge management at programme, project and team level including tailoring in line with agreed standards. Contributes to the definition of organisational policies, standards, and guidelines for knowledge management.","6":"Develops organisational policies, standards, and guidelines for knowledge management which  allow organisations to  respond quickly, to deliver services, make decisions and take actions. Champions and leads in the development of an organisational knowledge management approach and supporting technologies, processes and behaviours. Promotes knowledge-sharing through the organisation’s operational business processes and systems. Monitors and evaluates knowledge-sharing initiatives, including external bench-marking. Manages reviews of the benefits and value of knowledge management. Identifies and recommends improvements. Creates the business case justification for investment in knowledge management; identifies alternative solutions, assesses feasibility. Shares experiences across communities of practice, business units, and networks on innovative approaches in knowledge sharing.","7":"Leads the creation of a knowledge management culture. Develops an organisation-wide knowledge management strategy  for capturing, organising and developing information, knowledge and stories from employees,  customers and external partners. Embeds knowledge management across business units and develops strategic knowledge management capabilities. Reinforces the importance of knowledge sharing by aligning individual and organisational objectives and rewards. Identifies opportunities for strategic relationships or partnerships with customers, suppliers, and partners."},"description":"The systematic management of vital knowledge to create value for the organisation by capturing, sharing, developing and exploiting the collective knowledge of the organisation to improve performance, support decision making and mitigate risks. The development of a supportive and collaborative knowledge sharing culture to drive the successful adoption of  technology solutions for knowledge management. Providing access  to informal, tacit knowledge as well as formal, documented, explicit knowledge by facilitating internal and external collaboration and communications."},"Enterprise and business architecture":{"code":"STPL","levels":{"5":"Contributes to the creation and review of a systems capability strategy which meets the strategic requirements of the business. Develops models and plans to drive the execution of the strategy, taking advantage of opportunities to improve business performance. Takes responsibility for investigative work to determine requirements and specify effective business processes, through improvements in information systems, data management, practices, procedures, organisation and equipment.","6":"Leads the creation and review of a systems capability strategy that meets the strategic requirements of the business. Captures and prioritises market and environmental trends, business strategies and objectives, and identifies the business benefits of alternative strategies. Develops enterprise-wide architecture and processes which ensure that the strategic application of change is embedded in the management of the organisation, ensuring the buy-in of all key stakeholders. Develops and presents business cases, for high-level initiatives, approval, funding and prioritisation. Sets strategies, policies, standards and practices to ensure compliance between business strategies, technology strategies, and enterprise transformation activities.","7":"Directs the creation and review of an enterprise capability strategy to support the strategic requirements of the business. Identifies the business benefits of alternative strategies. Directs development of enterprise-wide architecture and processes which ensure that the strategic application of change is embedded in the management of the organisation. Ensures compliance between business strategies, enterprise transformation activities and technology directions, setting strategies, policies, standards and practices."},"description":"The creation, iteration, and maintenance of structures such as enterprise and business architectures embodying the key principles, methods and models that describe the organisation’s future state, and that enable its evolution. This typically involves the interpretation of business goals and drivers; the translation of business strategy and objectives into an “operating model”; the strategic assessment of current capabilities; the identification of required changes in capabilities; and the description of inter-relationships between people, organisation, service, process, data, information, technology and the external environment. The architecture development process supports the formation of the constraints, standards and guiding principles necessary to define, assure and govern the required evolution; this facilitates change in the organisation’s structure, business processes, systems and infrastructure in order to achieve predictable transition to the intended state."},"Business risk management":{"code":"BURM","levels":{"4":"Investigates and reports on hazards and potential risk events within a specific function or business area.","5":"Carries out risk assessment within a defined functional or technical area of business. Uses consistent processes for identifying potential risk events, quantifying and documenting the probability of occurrence and the impact on the business. Refers to domain experts for guidance on specialised areas of risk, such as architecture and environment. Co-ordinates the development of countermeasures and contingency plans.","6":"Plans and manages the implementation of organisation-wide processes and procedures, tools and techniques for the identification, assessment, and management of risk inherent in the operation of business processes and of potential risks arising from planned change.","7":"Establishes strategy for addressing risks arising from business operations and change. Provides resources to implement the strategy, and delegates authority for detailed planning and execution of risk management activities."},"description":"The planning and implementation of organisation-wide processes and procedures for the management of risk to the success or integrity of the business, especially those arising from the use of information technology, reduction or non-availability of energy supply or inappropriate disposal of materials, hardware or data."},"Sustainability":{"code":"SUST","levels":{"4":"Assesses and reports on how different tactical decisions affect sustainability. Evaluates factors and risks (political, legislative, technological, economic, social) that impact on operational processes and strategic direction. Evaluates and reports on implementation of sustainability measures in specific areas.","5":"Provides expert advice and guidance on planning, designing and implementing sustainability solutions. Evaluates and selects sustainability methods, tools and practices to be used in line with agreed policies and standards. Identifies and recommends improvements to the organisation’s approach to sustainability.","6":"Develops and promotes organisational strategies, policies, standards, and guidelines for sustainability. Leads the introduction and use of sustainability techniques, methodologies and tools."},"description":"The provision of advice, assistance and leadership to enable the organisation to minimise negative environmental impact."}},"Technical strategy and planning":{"Emerging technology monitoring":{"code":"EMRG","levels":{"4":"Supports monitoring of the external environment and assessment of emerging technologies to evaluate the potential impacts, threats and opportunities to the organisation. Contributes to the creation of reports, technology roadmapping and the sharing of knowledge and insights.","5":"Monitors the external environment to gather intelligence on emerging technologies. Assesses and documents the impacts, threats and opportunities to the organisation. Creates reports and technology roadmaps and shares knowledge and insights with others.","6":"Plans and leads the identification and assessment of new and emerging technologies and the evaluation of the potential impacts, threats and opportunities. Creates technology roadmaps which align organisational plans with emerging technology solutions. Engages with, and influences, relevant stakeholders to obtain organisational commitment to technology roadmaps. Develops organisational guidelines for monitoring emerging technologies. Collaborates with internal and external parties to facilitate intelligence gathering."},"description":"The identification of new and emerging technologies, products, services, methods and techniques. The assessment of their relevance and the potential impacts (both threats and opportunities) upon business enablers, cost, performance or sustainability. The communication of emerging technologies and their impact."},"Continuity management":{"code":"COPL","levels":{"4":"Implements and contributes to the development of a continuity management plan. Coordinates the assessment of risks to the availability, integrity and confidentiality of systems that support critical business processes. Coordinates the planning, designing, and testing of maintenance procedures and contingency plans.","5":"Leads the development and implementation of a continuity management plan. Identifies information and communication systems that support the critical business processes and manages the relationship with specialists with authority for those systems. Evaluates the critical risks associated with systems operation and identifies priority areas for improvement. Designs and implements a testing strategy to ensure that continuity plans and procedures address exposure to risk and that agreed levels of continuity are maintained."},"description":"The provision of service continuity planning and support, as part of, or in close cooperation with, the function which plans business continuity for the whole organisation. The identification of information systems which support critical business processes. The assessment of risks to critical systems’ availability, integrity and confidentiality. The co-ordination of planning, designing, testing and maintenance procedures and contingency plans to address exposures and maintain agreed levels of continuity."},"Network planning":{"code":"NTPL","levels":{"5":"Creates and maintains network plans for own area of responsibility, contributes to setting service level agreements, and plans the infrastructure necessary to provide the network services to meet such agreements.","6":"Creates and maintains overall network plans to support the organisation’s business strategy, agrees service level agreements with customers and plans all aspects of the infrastructure necessary to ensure provision of network services to meet such agreements."},"description":"The creation and maintenance of overall network plans, encompassing the communication of data, voice, text and image, in the support of an organisation’s business strategy. This includes participation in the creation of service level agreements and the planning of all aspects of infrastructure necessary to ensure provision of network services to meet such agreements. Physical implementation may include copper wire, fibre-optic, wireless, or any other technology."},"Solution architecture":{"code":"ARCH","levels":{"4":"Contributes to the development of solution architectures in specific business, infrastructure or functional areas. Identifies and evaluates alternative architectures and the trade-offs in cost, performance and scalability. Produces specifications of cloud-based or on-premises components, tiers and interfaces, for translation into detailed designs using selected services and products. Supports a change programme or project through the preparation of technical plans and application of design principles that comply with enterprise and solution architecture standards (including security).","5":"Leads the development of solution architectures in specific business, infrastructure or functional areas. Ensures that appropriate tools and methods are available, understood and employed in architecture development. Within a change programme, leads the preparation of technical plans and, in liaison with business assurance and project staff, ensures that appropriate technical resources are made available. Provides advice on technical aspects of solution development and integration (including requests for changes, deviations from specifications, etc.) and ensures that relevant technical strategies, policies, standards and practices (including security) are applied correctly.","6":"Leads the development of architectures for complex solutions, ensuring consistency with specified requirements agreed with both external, and internal customers. Takes full responsibility for the balance between functional, service quality and systems management requirements within a significant area of the organisation. Establishes policy and strategy for the selection of solution architecture components, and co-ordinates design activities, promoting the discipline to ensure consistency. Ensures that appropriate standards (corporate, industry, national and international) are adhered to. Within a business change programme, manages the target design, policies and standards, working proactively to maintain a stable, viable architecture and ensure consistency of design across projects within the programme."},"description":"The design and communication of high-level structures to enable and guide the design and development of integrated solutions that meet current and future business needs. In addition to technology components, solution architecture encompasses changes to service, process, organisation, and operating models. The provision of comprehensive guidance on the development of, and modifications to, solution components to ensure that they take account of relevant architectures, strategies, policies, standards and practices (including security) and that existing and planned solution components remain compatible."},"Data management":{"code":"DATM","levels":{"2":"Assists in providing accessibility, retrievability, security and protection of data in an ethical manner.","3":"Applies ethical and robust techniques in the transformation of data from one format\/medium to another, in line with organisational policies and procedures and being sensitive to risks around the use of information.","4":"Takes responsibility for the accessibility, retrievability, security, quality,   retention  and ethical handling of specific subsets of data. Assesses the integrity of data from multiple sources. Provides advice on the transformation of data\/information from one format or medium to another. Maintains and implements information handling procedures. Enables the availability, integrity and searchability of information through the application of formal data and metadata structures and protection measures. Manipulates specific data from information services, to satisfy defined information needs.","5":"Devises and implements master data management processes, including classification, security, quality, ethical principles, retrieval and retention processes. Derives data management structures and metadata to support consistency of information retrieval, combination, analysis, pattern recognition and interpretation, throughout the organisation. Plans effective data storage, sharing and publishing within the organisation. Independently validates external information from multiple sources. Assesses issues which might prevent the organisation from making maximum use of its information assets.","6":"Derives an overall strategy of master data management, within an established information architecture, that supports the development and secure operation of information and digital services. Develops organisational policies, standards, and guidelines for data management, aligned with ethical principles. Takes overall responsibility for planning effective data storage, security, quality, sharing, availability, retention and publishing within the organisation. Plans, establishes and manages processes for regular and consistent access to, and independent validation of external information from multiple sources."},"description":"The management of practices and processes to ensure the security, quality, integrity, safety and availability of all forms of data and data structures that make up the organisation’s information. The management of data and information in all its forms and the analysis of information structure (including logical analysis of taxonomies, data and metadata). The development of innovative ways of managing the information assets of the organisation."},"Methods and tools":{"code":"METL","levels":{"3":"Provides support on the use of existing method and tools. Configures methods and tools within a known context. Creates and updates the documentation of methods and tools.","4":"Provides advice and guidance to support adoption of methods and tools and adherence to policies and standards. Tailors processes in line with agreed standards and evaluation of methods and tools. Reviews and improves usage and application of methods and tools.","5":"Provides advice, guidance and expertise to promote adoption of methods and tools and adherence to policies and standards. Evaluates and selects appropriate methods and tools in line with agreed policies and standards. Implements methods and tools at programme, project and team level including selection and tailoring in line with agreed standards. Manages reviews of the benefits and value of methods and tools. Identifies and recommends improvements. Contributes to organisational policies, standards, and guidelines for methods and tools.","6":"Develops organisational policies, standards, and guidelines for methods and tools. Sets direction and leads in the introduction and use of techniques, methodologies and tools, to match overall business requirements, ensuring consistency across all user groups. Leads the development of organisational capabilities for methods and tools (including automation) to ensure adoption and adherence to policies and standards."},"description":"The definition, tailoring, implementation,  assessment, measurement, automation and improvement of methods and tools to support  planning, development, testing, operation, management and maintenance of systems. Ensuring methods and tools  are adopted and used effectively throughout the organisation."}}},"Change and transformation":{"Business change implementation":{"Portfolio management":{"code":"POMG","levels":{"5":"Ensures that programme\/project leads and\/or service owners adhere to the agreed portfolio management approach and timetable and that they provide the appropriate information to agreed targets of timelines and accuracy. Produces reports as appropriate for portfolio governance, including making recommendations for changes to the portfolio.","6":"Leads the definition of a portfolio of programmes, projects, and\/or on-going service provision. Engages and influences senior managers to ensure the portfolio will deliver the agreed business objectives. Plans, schedules, monitors and reports on activities related to the portfolio to ensure that each part of the portfolio contributes to the overall achievement of the portfolio. Collects, summarises and reports on portfolio KPIs often through the deployment of business management processes and systems. Identifies issues with portfolio structure, cost, risk, inter-dependencies, impact on current business activities and the strategic benefits to be realised. Notifies projects\/programmes\/change initiatives of issues and recommends and monitors corrective action. Reports on portfolio status as appropriate.","7":"Leads the definition, implementation and review of the organisation’s portfolio management framework. Authorises the structure of portfolios and is responsible for alignment with business strategy & objectives and with emerging IT and digital opportunities. Sets parameters for the prioritisation of resources and the changes to be implemented. Recommends and implements corrective action by engaging and influencing senior management. Leads the on-going monitoring and review of portfolios for impact on current business activities and the strategic benefits to be realised. Is responsible for implementing effective portfolio governance arrangements supported by effective reporting."},"description":"The development and application of a systematic management framework to define and deliver a portfolio of programmes, projects and\/or ongoing services, in support of specific business strategies and objectives. Includes the implementation of a strategic investment appraisal and decision making process based on a clear understanding of cost, risk, inter-dependencies, and impact on existing business activities, enabling measurement and objective evaluation of potential changes and the benefits to be realised. The prioritisation of resource utilisation and changes to be implemented. The regular review of portfolios. The management of the service pipeline (proposed or in development), service catalogue (live or available for deployment) and retired services."},"Programme management":{"code":"PGMG","levels":{"6":"Plans, directs, and co-ordinates activities to manage and implement a programme from contract \/proposal initiation to final operational stage including the transition into “business-as-usual”; plans, schedules, monitors, and reports on activities related to the programme. Ensures that programmes are managed to realise business benefits and that programme management is informed by an awareness of current technical developments.","7":"Sets organisational strategy governing the direction and conduct of programme management, including application of appropriate methodologies. Plans, directs, and co-ordinates activities to manage and implement complex programmes from contract \/proposal initiation to full integration with “business as usual”. Aligns the programme objectives with business objectives, and authorises the selection and planning of all related projects and activities. Plans, schedules, monitors, and reports on activities related to the programme, ensuring that there are appropriate and effective governance arrangements, supported by comprehensive reporting and communication."},"description":"The identification, planning and coordination of a set of related projects within a programme of business change, to manage their interdependencies in support of specific business strategies and objectives. The maintenance of a strategic view over the set of projects, providing the framework for implementing business initiatives, or large-scale change, by conceiving, maintaining and communicating a vision of the outcome of the programme and associated benefits. (The vision, and the means of achieving it, may change as the programme progresses). Agreement of business requirements, and translation of requirements into operational plans. Determination, monitoring, and review of programme scope, costs, and schedule, programme resources, inter-dependencies and programme risk."},"Project management":{"code":"PRMG","levels":{"4":"Defines, documents and carries out small projects or sub-projects (typically less than six months, with  limited budget, limited interdependency with other projects, and no significant strategic impact), alone or with a small team, actively participating in all phases. Identifies, assesses and manages risks to the success of the project. Applies appropriate project management methods and tools whether predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Agrees project approach with stakeholders, and prepares realistic plans (including quality, risk and communications plans) and tracks activities against the project schedule, managing stakeholder involvement as appropriate. Monitors costs, timescales and resources used, and takes action where these deviate from agreed tolerances. Ensures that own projects are formally closed and, where appropriate, subsequently reviewed, and that lessons learned are recorded.","5":"Takes full responsibility for the definition, approach, facilitation and satisfactory completion of medium-scale projects (typically with direct business impact and firm deadlines). Identifies, assesses and manages risks to the success of the project. Ensures that realistic project plans are maintained and ensures regular and accurate communication to stakeholders. Adopts appropriate  project management methods and tools whether predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Ensures Quality reviews occur on schedule and according to procedure. Manages the change control procedure, and ensures that project deliverables are completed within agreed cost, timescale and resource budgets, and are signed off. Provides effective leadership to the project team, and takes appropriate action where team performance deviates from agreed tolerances.","6":"Takes full responsibility for the definition, documentation and successful completion of complex projects (typically with significant business, political, or high-profile impact, and high-risk dependencies). Adopts and adapts project management methods and tools, selecting appropriately from plan-driven\/predictive approaches or more adaptive (iterative and agile) approaches. Ensures that effective project control, change control, risk management and testing processes are maintained.  Monitors and controls resources, revenue and capital costs against the project budget and manages expectations of all project stakeholders.","7":"Sets organisational strategy governing the direction and conduct of project management, including application of appropriate methodologies. Authorises the management of large scale projects. Leads project planning, scheduling, controlling and reporting activities for strategic, high impact, high risk projects. Manages risk and ensures that solutions to problems are implemented in line with change control processes."},"description":"The management of projects, typically (but not exclusively) involving the development and implementation of business processes to meet identified business needs, acquiring and utilising the necessary resources and skills, within agreed parameters of cost, timescales, and quality. The adoption and adaptation of project management methodologies based on the context of the project and selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches."},"Portfolio, programme and project support":{"code":"PROF","levels":{"2":"Assists with the compilation of portfolio, programme and project management reports. Maintains programme and project files from supplied actual and forecast data.","3":"Uses recommended portfolio, programme and project control solutions for planning, scheduling and tracking. Sets up project files, compiles and distributes reports. Provides administrative services to project boards, project assurance teams and quality review meetings. Provides guidance on project management software, procedures, processes, tools and techniques.","4":"Takes responsibility for the provision of support services to projects. Uses and recommends project control solutions for planning, scheduling and tracking projects. Sets up and provides detailed guidance on project management software, procedures, processes, tools and techniques. Supports programme or project control boards, project assurance teams and quality review meetings. Provides basic guidance on individual project proposals. May be involved in aspects of supporting a programme by providing a cross programme view on risk, change, quality, finance or configuration management.","5":"Takes responsibility for the provision of portfolio, programme and project support. Advises on the available standards, procedures, methods, tools and techniques. Evaluates project and\/or programme performance and recommends changes where necessary. Contributes to reviews and audits of project and programme management to ensure conformance to standards.","6":"Defines the approach\/policy and sets standards for the support provided for managing and monitoring portfolios, programmes, and projects. This can also include: the governance\/management of resources,  directing and leading the implementation and on-going operation of an effective service organisation, ensuring delivery of effective services\/resources in line with current and planned demand and reviewing the effective provision."},"description":"The provision of support and guidance on portfolio, programme and project management processes, procedures, tools and techniques. Support includes definition of portfolios, programmes, and projects; advice on the development, production and maintenance of business cases; time, resource, cost and exception plans, and the use of related software tools. Tracking and reporting of programme\/project progress and performance are also covered, as is the capability to facilitate all aspects of portfolio\/ programme\/ project meetings, workshops and documentation."}},"Business change management":{"Business analysis":{"code":"BUAN","levels":{"3":"Investigates operational needs and problems, and opportunities, contributing to the recommendation of improvements in automated and non-automated components of new or changed processes and organisation. Assists in defining acceptance tests for these recommendations.","4":"Investigates operational requirements, problems, and opportunities, seeking effective business solutions through improvements in automated and non-automated components of new or changed processes. Assists in the analysis of stakeholder objectives, and the underlying issues arising from investigations into business requirements and problems, and identifies options for consideration. Works with stakeholders, to identify potential benefits and available options for consideration, and in defining acceptance tests. Contributes to selection of the business analysis methods, tools and techniques for projects; selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches.","5":"Takes responsibility for investigative work to determine business requirements and specify effective business processes, through improvements in information systems, information management, practices, procedures, and organisation change. Selects, adopts and adapts appropriate business analysis methods, tools and techniques; selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Collaborates with stakeholders at all levels, in the conduct of investigations for strategy studies, business requirements specifications and feasibility studies. Prepares business cases which define potential benefits, options for achieving these benefits through development of new or changed processes, and associated business risks.","6":"Takes full responsibility for business analysis within a significant segment of an organisation where the advice given, and decisions made will have a measurable impact on the profitability or effectiveness of the organisation. Leads the selection of appropriate business analysis methods, tools, techniques; selecting appropriately from plan-driven\/predictive approaches or more adaptive (iterative and agile) approaches. Establishes the contribution that technology can make to business objectives, defining strategies, validating and justifying business needs, conducting feasibility studies, producing high-level and detailed business models, preparing business cases, overseeing development and implementation of solutions, taking into account the implications of change on the organisation and all stakeholders. Guides senior management towards accepting change brought about through process and organisational change."},"description":"The methodical investigation, analysis, review and documentation of all or part of a business in terms of business goals, objectives, functions and processes, the information used and the data on which the information is based. The definition of requirements for improving processes and systems, reducing their costs, enhancing their sustainability, and the quantification of potential business benefits. The collaborative creation and iteration of viable specifications and acceptance criteria in preparation for the deployment of information and communication systems. The adoption and adaptation of business analysis approaches based on the context of the work and selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches."},"Business modelling":{"code":"BSMO","levels":{"2":"Understands the purpose and benefits of modelling. Uses established techniques as directed to model simple subject areas with clearly-defined boundaries. May assist in more complex modelling activities. Develops models with input from subject matter experts and communicates the results back to them for review and confirmation.","3":"Conversant with techniques covering full range of modelling situations. Models current and desired scenarios as directed. Selects appropriate modelling techniques for meeting assigned objectives. Gains agreement from subject matter experts to models produced. Reviews resulting models with stakeholders and gains resolution to resultant issues.","4":"Conducts advanced modelling activities for significant change programmes and across multiple business functions. Has an in-depth knowledge of organisation-standard techniques. Plans own modelling activities, selecting appropriate techniques and the correct level of detail for meeting assigned objectives. May contribute to discussions about the choice of the modelling approach to be used. Obtains input from and communicates modelling results to senior managers for agreement.","5":"Produces models in support of business strategy. Has in-depth knowledge of a broad range of industry-wide modelling techniques. Advises on the choice of techniques and approach and influences customers accordingly. Capable of developing bespoke models for unusual contexts. Responsible for planning and co-ordinating team modelling activities and for ensuring the quality of their work.","6":"Defines modelling standards and quality targets for an organisation. Has continuing responsibility for the maintenance of models for a designated function. Initiates organisation-wide modelling improvement activities and obtains customer buy-in to general changes. May represent own organisation as a modelling expert in industry initiatives."},"description":"The production of abstract or distilled representations of real world, business or gaming situations in traditional or trans-media applications, to aid the communication and understanding of existing, conceptual or proposed scenarios. Predominantly focused around the representation of processes, roles, data, organisation and time. Models may be used to represent a subject at varying levels of detail and decomposition."},"Requirements definition and management":{"code":"REQM","levels":{"2":"Assists in the definition and management of requirements. Uses standard techniques to elicit, specify, and document requirements for simple subject areas with clearly-defined boundaries. Assists in the creation of a requirements baseline and in investigating and applying authorised requests for changes to base-lined requirements, in line with change management policy.","3":"Defines and manages scoping, requirements definition and prioritisation activities for small-scale changes and assists with more complex change initiatives. Follows agreed standards, applying appropriate techniques to elicit and document detailed requirements. Provides constructive challenge to stakeholders as required. Prioritises requirements and documents traceability to source. Reviews requirements for errors and omissions. Provides input to the requirements base-line. Investigates, manages and applies authorised requests for changes to base-lined requirements, in line with change management policy.","4":"Contributes to selection of the requirements approach for projects, selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Defines and manages scoping, requirements definition and prioritisation activities for initiatives of medium size and complexity. Facilitates input from stakeholders, provides constructive challenge and enables effective  prioritisation of requirements. Reviews requirements for errors and omissions. Establishes the requirements base-lines, obtains formal agreement to requirements, and ensures traceability to source. Investigates, manages, and applies authorised requests for changes to base-lined requirements, in line with change management policy.","5":"Plans and drives scoping, requirements definition and prioritisation activities for large, complex  initiatives. Selects, adopts and adapts appropriate requirements definition and management methods, tools and techniques selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Obtains input from, and formal agreement to, requirements from a diverse range of stakeholders. Negotiates with stakeholders to manage competing priorities and conflicts. Establishes requirements baselines. Ensures changes to requirements are investigated and managed. Contributes to the development of organisational methods and standards.","6":"Develops organisational policies, standards, and guidelines for requirements definition and management. Raises awareness and champions the importance and value of requirements  management principles and the selection of appropriate requirements  management lifecycle models. Drives adoption of, and adherence to, policies and standards. Develops new methods and organisational capabilities. Plans and leads scoping, requirements definition and priority setting for complex, strategic programmes."},"description":"The elicitation, analysis, specification and validation of requirements and constraints to a level that enables effective development and operations of new or changed software, systems, processes, products and services. The management of requirements throughout the whole of the delivery and operational life cycle of the software, system, processes, products or services. The negotiation of trade-offs that are both acceptable to key stakeholders and within budgetary, technical, regulatory, and other constraints. The adoption and adaptation of requirements management lifecycle models based on the context of the work and selecting appropriately from plan-driven\/predictive approaches or more adaptive (iterative and agile) approaches."},"Organisational capability development":{"code":"OCDV","levels":{"5":"Develops and maintains a detailed knowledge of capability improvement approaches and techniques and selects appropriate approaches for the organisation. Contributes effectively to identifying new areas of capability improvement within the organisation which may be enhancements to skills, technology or processes. Carries out capability improvement assignments, such as maturity or performance assessments to identify strengths and weaknesses. Selects and prioritises improvement opportunities, generates buy-in and plans improvement activities justified by measurable organisational benefits. Mentors and supports localised continuous improvement activities.","6":"Leads substantial improvement programmes. Seeks out, identifies, proposes, and initiates capability improvement activities within the organisation typically driven by the need to enhance performance, satisfy new business opportunities or to respond to external drivers. Selects frameworks, approaches and techniques for use. Plans and manages the evaluation or assessment of organisational capabilities. Devises solutions and leads change initiatives including communication, transition and implementation activities. Takes action to exploit opportunities to deliver measurable, beneficial impacts upon operational effectiveness. Monitors international, national, and sector trends in order to establish the needed capability.","7":"Represents and leads organisational capability improvement at the highest level. Determines the need for strategic organisation-level capability improvement to satisfy the strategic goals and long-term objectives of the organisation. Liaises with the organisation’s functions to establish requirements and identifies, proposes, initiates and leads significant organisational capability improvement programmes. Manages the quality and appropriateness of the work performed and delivers measurable business benefits. Adopts and\/or modifies existing capability improvement approaches as necessary."},"description":"The provision of leadership, advice and implementation support to assess organisational capabilities and to identify, prioritise and implement improvements. The selection, adoption and integration of appropriate industry frameworks and models to guide improvements. The systematic use of capability maturity assessments, metrics, process definition, process management, repeatability and  the introduction of appropriate techniques, tools and enhanced skills. The delivery of an integrated people, process and technology solution to deliver improved organisational performance in line with organisation’s strategic plans and objectives. The scope of improvement is organisational but may also be highly focussed as necessary for example software development, systems development, project delivery or service improvement."},"Organisation design and implementation":{"code":"ORDI","levels":{"5":"Implements organisational structure and culture change activities. Conducts impact assessments to ensure organisational structure and cultures are aligned to changes in processes, systems, technology and tools. Develops graphical representations of organisation models and structures to facilitate understanding and decision-making. Identifies and evaluates alternative solutions. Outlines how organisation structure, people development, jobs, teams and roles need to change to enable the future business processes. Aligns existing organisational structures, roles and jobs to new processes. Advises on implications of introducing new workplace models and tools.","6":"Champions the value of new ways of working to address internal and external opportunities and threats arising from changes in technology, society and business models. Sets direction and leads in the introduction and use of organisation design techniques, methodologies and tools to change and improve organisation structures and culture to deliver business outcomes. Plans and leads organisation design activities; identifies alternatives, assesses feasibility, and recommends solutions. Identifies major changes affecting the organisation, and mobilises resources to implement changes. Initiates the definition of new organisation boundaries, and creates future organisation design, including location strategy and the number of locations required. Outlines performance measurement objectives and the high-level implementation approach.","7":"Establishes and communicates the need and rationale for organisational structure and culture change. Secures organisational commitment and resources needed for organisational and culture change. Leads organisational change by removing obstacles, advocating and lobbying for change at the highest levels. Puts in place mechanisms to reinforce and embed organisational and culture change. Acts as a role model for desired behaviours and sets consistent standards and expectations."},"description":"The planning, design and implementation of an integrated organisation structure and culture including the workplace environment, locations, role profiles, performance measurements, competencies and skills. The facilitation of changes needed to adapt to changes in technologies, society, new operating models and business processes. The identification of key attributes of the required culture and how these can be implemented and reinforced to bring about improved organisational performance."},"Change implementation planning and management":{"code":"CIPM","levels":{"5":"Creates the business readiness plan, taking into consideration IT deployment, data migration, capability deployment (training and engagement activities) and any business activities required to integrate new digital processes or jobs into the \"business as usual\" environment. Determines the readiness levels of business users with regard to upcoming changes; uncovers readiness gaps and creates and implements action plans to close the gaps prior to going live. Assists the user community in the provision of transition support and change planning, and liaises with the project team. Monitors and reports progress on business readiness targets, business engagement activity, training design and deployment activities, key operational metrics and return to productivity measures. Defines the series and sequence of activities to bring stakeholders to the required level of commitment, prior to going live.","6":"Ensures that there is a business perspective on how any new technical capabilities will be integrated into the business, including planning around key business cycles, selecting appropriate customers for migration, etc. Initiates the business implementation plan, including all the activities that the business needs to do to prepare for new technical components and technologies. Ensures sites deliver site implementation plans that align with the overall plan. Tracks and reports against these activities to ensure progress. Defines and manages the activities to ensure achievement of the projected business benefits after delivery. Outlines key business engagement messages that need to be communicated throughout the programme\/project."},"description":"The definition and management of the process for deploying and integrating new digital capabilities into the business in a way that is sensitive to and fully compatible with business operations."},"Business process testing":{"code":"BPTS","levels":{"4":"Specifies and develops test scenarios to test that new\/updated processes deliver improved ways of working for the end user at the same time as delivering efficiencies and planned business benefits. Records and analyses test results, and reports any unexpected or unsatisfactory outcomes. Uses test plans and outcomes to specify user instructions.","5":"Designs and manages tests of new\/updated processes. Specifies test environment for whole life-cycle testing (for example, using a model office concept). Manages selection\/creation of relevant scenarios for testing and ensures that tests reflect realistic operational business conditions. Ensure tests and results are documented, reported to stakeholders and are available for specification of user instructions. Highlights issues and risks identified during testing to business stakeholders. Provides specialist guidance and advice to less experienced colleagues and users to ensure that test are conducted in an appropriate manner.","6":"Is responsible for organisational commitment to high standards in human factors. Specifies ergonomics standards and methods to meet organisational objectives. Sets the policy and standards for business process testing. Manages the design and execution of business process tests, usability evaluations, network and business trials, confidence tests. Maintains an overview of the business environment, required outcomes and potential exposures."},"description":"The planning, design, management, execution and reporting of business process tests and usability evaluations. The application of evaluation skills to the assessment of the ergonomics, usability and fitness for purpose of defined processes. This includes the synthesis of test tasks to be performed (from statement of user needs and user interface specification), the design of an evaluation programme, the selection of user samples, the analysis of performance, and inputting results to the development team."},"Benefits management":{"code":"BENM","levels":{"5":"Identifies specific measures and mechanisms by which benefits can be measured, and plans to activate these mechanisms at the required time. Monitors benefits against what was predicted in the business case and ensures that all participants are informed and involved throughout the change programme and fully prepared to exploit the new operational business environment once it is in place. Supports operational managers to ensure that all plans, work packages and deliverables are aligned to the expected benefits and leads activities required in the realisation of the benefits of each part of the change programme.","6":"Promotes the change programme vision to staff at all levels of the business operation, brings order to complex situations, and keeps a focus on business objectives. Works with operational managers to ensure maximum improvements are made in the business operations as groups of projects deliver their products into operational use. Maintains the business case for funding the programme and confirms continuing business viability of the programme at regular intervals."},"description":"Establishing an approach for forecasting, planning and monitoring the emergence and effective realisation of anticipated benefits. Identifying and implementing the actions needed to optimise the business impact of individual and combined benefits. The confirmation of the achievement of expected benefits."}}},"Development and implementation":{"Systems development":{"Systems development management":{"code":"DLMG","levels":{"5":"Defines systems development projects which support the organisation’s objectives and plans. Selects, adopts and adapts appropriate systems development methods, tools and techniques selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Ensures that senior management is both aware of and able to provide the required resources. Facilitates availability and optimum utilisation of resources. Monitors and reports on the progress of development projects, ensuring that projects are carried out in accordance with agreed architectures, standards, methods and procedures (including secure software development). Develops road maps to communicate future development activity.","6":"Sets policy and drives adherence to standards for systems development projects whether predictive (plan-driven) approaches or more adaptive (iterative\/agile) approaches. Promotes the benefits of addressing all security issues during systems development. Identifies and manages the resources necessary for all stages (planning, estimation, execution) of systems development projects, ensuring that technical, financial and quality targets are met.","7":"Leads the definition, implementation and review of the organisation’s systems development management framework. Authorises the structure of systems development functions and platforms and is responsible for alignment with business strategy & objectives and with emerging IT and digital opportunities. Sets strategy for resource management within systems development, authorises the allocation of resources for systems development programmes, and maintains an overview of the contribution of such programmes to organisational success. Manages the quality and appropriateness of the work performed and delivers measurable business benefits."},"description":"The planning, estimating and execution of programmes of systems development work to time, budget and quality targets. The identification of the resources needed for systems development and how this will be met with an effective supply capacity. The alignment of systems development activity and deliverables with agreed architectures and standards. The development of roadmaps to communicate future systems development plans. The adoption and adaptation of systems development lifecycle models based on the context of the work and selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches."},"Systems design":{"code":"DESN","levels":{"4":"Designs components using appropriate modelling techniques following agreed architectures, design standards, patterns and methodology. Identifies and evaluates alternative design options and trade-offs. Creates multiple design views to address the concerns of the different stakeholders of the architecture and to handle both functional and non-functional requirements. Models, simulates or prototypes the behaviour of proposed systems components  to enable approval by stakeholders. Produces detailed design specification to form the basis for construction of systems. Reviews, verifies and improves own designs against specifications.","5":"Adopts and adapts appropriate systems design methods, tools and techniques selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches, and ensures they are applied effectively. Designs large or complex systems. Undertakes impact analysis on major design options and trade-off. Makes recommendations and assesses and manages associated risks. Reviews others’ systems designs to ensure selection of appropriate technology, efficient use of resources, and integration of multiple systems and technology. Ensures that the system design balances functional and non-functional requirements. Contributes to development of systems design policies and standards and selection of architecture components.","6":"Develops organisational policies, standards, guidelines, and methods for systems design. Champions the importance and value of systems design principles and the selection of appropriate systems design lifecycle models; whether predictive (plan-driven) approaches or more adaptive (iterative\/agile) approaches. Drives adoption of and adherence to relevant policies, standards, strategies and architectures. Leads systems design activities for strategic, large and complex systems development programmes. Develops effective implementation and procurement strategies, consistent with specified requirements, architectures and constraints of performance and feasibility. Develops systems designs requiring introduction of new technologies or new uses for existing technologies."},"description":"The design of systems to meet specified requirements, compatible with agreed systems architectures, adhering to corporate standards and within constraints of performance and feasibility. The identification of concepts and their translation into a design which forms the basis for systems construction and verification. The design or selection of components. The development of a complete set of detailed models, properties, and\/or characteristics described in a form suitable for implementation. The adoption and adaptation of systems design lifecycle models based on the context of the work and selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches."},"Software design":{"code":"SWDN","levels":{"2":"Creates and documents detailed designs for simple software applications or components applying agreed modelling techniques, standards, patterns and tools. Contributes to the design of components of larger software systems. Reviews own work.","3":"Undertakes complete design of moderately complex software applications or components applying agreed standards, patterns and tools. Assists as part of a team in the design of components of larger software systems. Specifies user and\/or system interfaces. Creates multiple design views to address the concerns of the different stakeholders of the design and to handle separately functional and non-functional requirements. Assists in the evaluation of options and trade-offs. Collaborates in reviews of work with others as appropriate.","4":"Designs software components and modules using appropriate modelling techniques following agreed software design standards, patterns and methodology. Creates and communicates multiple design views to identify and balance the concerns of all stakeholders of the software design and to allow for both functional and non-functional requirements. Identifies and evaluates alternative design options and trade-offs. Recommends designs which take into account target environment, performance security requirements and existing systems. Reviews, verifies and improves own designs against specifications. Leads reviews of others’ designs. Models, simulates or prototypes the behaviour of proposed software to enable approval by stakeholders, and effective construction of the software. Verifies software design by constructing and applying appropriate methods.","5":"Selects, adopts and adapts appropriate software design methods, tools and techniques; selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Specifies and designs large or complex software components. Undertakes impact analysis on major design options, makes recommendations and assesses and manages associated risks. Specifies prototypes\/simulations to enable informed decision making. Evaluates the quality of others’ systems designs to ensure adherence to standards and identifies corrective action, if needed. Ensures that the system design balances functional, quality, security and systems management requirements. Contributes to development of organisational software design and architecture policies and standards.","6":"Leads the selection and development of appropriate software design methods, tools, techniques; whether predictive (plan-driven) approaches or more adaptive (iterative\/agile) approaches. Develops organisational policies, standards, and guidelines for software design and software architectures. Ensures adherence to technical strategies and systems architectures (including security)."},"description":"The specification and design of software to meet defined requirements by following agreed design standards and principles. The definition of software, components, interfaces and related characteristics. The identification of concepts and patterns and the translation into a design which provides a basis for software construction and verification. The evaluation of alternative solutions and trade-offs. The facilitation of design decisions within the constraints of systems designs, design standards, quality, feasibility, extensibility and maintainability. The development and iteration of prototypes\/simulations to enable informed decision-making. The adoption and adaptation of software design  models, tools and techniques based on the context of the work and selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches."},"Programming\/software development":{"code":"PROG","levels":{"2":"Designs, codes, verifies, tests, documents, amends and refactors simple programs\/scripts. Applies agreed standards and tools, to achieve a well-engineered result. Reviews own work.","3":"Designs, codes, verifies, tests, documents, amends and refactors moderately complex programs\/scripts. Applies agreed standards and tools, to achieve a well-engineered result. Collaborates in reviews of work with others as appropriate.","4":"Designs, codes, verifies, tests, documents, amends and refactors complex programs\/scripts and integration software services. Contributes to selection of the software development approach for projects, selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Applies agreed standards and tools, to achieve well-engineered outcomes. Participates in reviews of own work and leads reviews of colleagues’ work.","5":"Takes technical responsibility across all stages and iterations of software development. Plans and drives software construction activities. Adopts and adapts appropriate software development methods, tools and techniques selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Measures and monitors applications of project\/team standards for software construction including software security. Contributes to the development of organisational policies, standards, and guidelines for software development.","6":"Develops organisational policies, standards, and guidelines for software construction and refactoring. Plans and leads software construction activities for strategic, large and complex development projects. Develops new methods and organisational capabilities and drives adoption of, and adherence to policies and standards."},"description":"The planning, designing, creation, amending, verification, testing and documentation of new and amended software components in order to deliver agreed value to stakeholders. The identification, creation and application of agreed software development and security standards and processes. Adopting and adapting software development lifecycle models based on the context of the work and selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches."},"Real-time\/embedded systems development":{"code":"RESD","levels":{"2":"Designs the interactions between simple embedded systems components with hardware and the physical world, through sensors, actuators and I\/O ports. Uses low level programming languages to develop simple real-time\/embedded components as part of an overall systems design. Applies standard approaches to perform extensive testing of real-time\/embedded systems, using specialised tools such as logic analysers, in-circuit emulators or digital storage oscilloscopes.","3":"Designs the interactions between medium-complexity embedded systems components with hardware and the physical world through sensors, actuators and I\/O ports. Selects and uses appropriate programming languages (high and low-level) and scripting languages to develop medium complex real-time\/embedded components as part of an overall systems design typically requiring high levels of reliability or integrity. Applies a range of approaches to perform extensive testing of real-time\/embedded systems, using specialised tools such as logic analysers, in-circuit emulators or digital storage oscilloscopes to demonstrate that high levels of systems integrity and reliability are addressed.","4":"Designs and develops complex real-time\/embedded systems components often incorporating fail-safe characteristics or graceful degradation. Develops and implements software to operate in embedded systems. Develops prototypes or simulations of real time\/embedded systems to support decision-making. Designs physical layouts reflecting connections between the components of real-time\/embedded systems to test and optimise performance. Contributes to validation and verification activities. Uses specialised tools and hardware (such as logic analysers, in-circuit emulators or digital storage oscilloscopes) for developing, testing, debugging and troubleshooting of embedded software to ensure high levels of integrity and reliability.","5":"Develops real-time\/embedded software architectures and designs to meet agreed systems specifications within resource constraints due to power, cost, physical space, response time and reliability. Selects programming languages, models, techniques, specialised tools and hardware to enable the design, development, debugging and validation of real-time\/embedded software. Plans and manages real- time\/embedded systems developments. Undertakes impact analysis on major design options and trade-offs between hardware and software, makes recommendations and assesses and manages associated risks. Validates and verifies other’s designs to ensure selection of appropriate components and efficient use of resources. Investigates the impact of software requirements with complementary hardware and other related disciplines such as electrics, electronics, mechanics, acoustics, physiology and optics.","6":"Provides overall direction in the conception and design of real-time\/embedded systems. Develops real-time\/embedded software architectures in order to exploit new technologies or new uses for existing technologies. Develops effective implementation and procurement strategies, consistent with specified requirements, systems architectures and constraints of performance, cost and feasibility. Sets organisational policies and standards for, and leads on, the development of real-time\/embedded systems including how critical non-functional requirements such as performance, safety, security, and reliability are achieved. Drives adoption of and adherence to relevant strategies, policies, standards."},"description":"The architecture, design and development of reliable real time software, operating systems, tools and embedded systems. Embedding computer systems with a dedicated function within a larger mechanical or electronic system, often with real-time, safety, security, and reliability constraints. Typically includes interfacing with hardware, mechanical sensors and actuators for monitoring and control in applications such as industrial, automotive, aerospace and medical machinery, robots and equipment including IoT (Internet of Things) devices."},"Animation development":{"code":"ADEV","levels":{"3":"Uses design tools (such as wireframes) to evolve prototypes of web pages. Using complex visual design tools, employs organic modelling techniques, such as boned rigs to create and animate virtual characters within the context of a game (or similar system) design. Builds visual and audio components.","4":"Uses design tools (such as wireframes) to evolve rapid prototypes of web pages, and assess the viability of design concepts. Using complex visual design tools, employs organic modelling techniques, such as boned rigs to create and animate virtual characters within the context of a game (or similar system) design. Builds visual and audio components and integrates them into the system structure, typically using a games engine.","5":"Develops conceptual structures into design blueprints, typically using tools such as interaction diagrams and wireframes, to create high-level structures and runtime architectures for websites. Manages iterations of level design and storytelling, documenting overall flow and architecture of a game or similar system.","6":"Provides overall creative direction in the conception and design of animation products such as games and simulations."},"description":"The architecture, design and development of animated and interactive systems such as games and simulations."},"Data modelling and design":{"code":"DTAN","levels":{"2":"Applies data analysis, design, and modelling techniques to establish, modify or maintain a data structure and its associated components (entity descriptions, relationship descriptions, attribute definitions).","3":"Applies data analysis, design, modelling, and quality assurance techniques, based upon a detailed understanding of business processes, to establish, modify or maintain data structures and associated components (entity descriptions, relationship descriptions, attribute definitions). Advises database designers and other application development team members on the details of data structures and associated components.","4":"Investigates corporate data requirements, and applies data analysis, design, modelling, and quality assurance techniques, to establish, modify or maintain data structures and their associated components (entity descriptions, relationship descriptions, attribute definitions). Provides advice and guidance to database designers and others using the data structures and associated components.","5":"Sets standards for data modelling and design tools and techniques, advises on their application, and ensures compliance. Manages the investigation of corporate data requirements, and co-ordinates the application of data analysis, design and modelling techniques, based upon a detailed understanding of the corporate information requirements, in order to establish, modify or maintain data structures and their associated components (entity descriptions, relationship descriptions, attribute definitions). Manages the iteration, review and maintenance of data requirements and data models."},"description":"The development of models to represent and communicate data requirements and to enable organisations to understand their data assets and the relationships between real-world entities. The investigation, analysis and scoping of data requirements to support the development of software systems, data integration and data retrieval activities. The iteration, review and maintenance of data requirements and data models."},"Database design":{"code":"DBDS","levels":{"3":"Develops appropriate physical database or data warehouse design elements, within set policies, to meet business change or development project data requirements. Interprets installation standards to meet project needs and produces database or data warehouse component specifications.","4":"Develops and maintains specialist knowledge of database and data warehouse concepts, design principles, architectures, software and facilities. Assesses proposed changes to object\/data structures, in order to evaluate alternative options. Implements physical database designs to support transactional data requirements for performance and availability. Implements data warehouse designs that support demands for business intelligence and data analytics.","5":"Provides expert guidance in the selection, provision and use of database and data warehouse architectures, software and facilities. Provides specialist expertise in the design characteristics of database management systems (DBMS) or data warehouse products\/services. Ensures that physical database design policy supports transactional data requirements for performance and availability. Ensures that data warehouse design policy supports demands for business intelligence and data analytics."},"description":"The specification, design and maintenance of mechanisms for storage of and access to data in support of business information needs. Design of the physical data layer, addressing enterprise data resource needs and local stored data structures. Definition of physical or virtual data warehouse structures required to support business intelligence and data analytics services."},"Network design":{"code":"NTDS","levels":{"5":"Produces outline system designs and specifications, and overall architectures, topologies, configuration databases and design documentation of networks and networking technology within the organisation. Specifies user\/system interfaces, including validation and error correction procedures, processing rules, access, security and audit controls. Assesses associated risks, and specifies recovery routines and contingency procedures. Translates logical designs into physical designs.","6":"Takes responsibility for major aspects of network specification and design within the organisation. Produces network design policies, philosophies and criteria covering connectivity, capacity, interfacing, security, resilience, recovery, access and remote access."},"description":"The production of network designs and design policies, strategies, architectures and documentation, covering voice, data, text, e-mail, facsimile and image, to support strategy and business requirements for connectivity, capacity, interfacing, security, resilience, recovery, access and remote access. This may incorporate all aspects of the communications infrastructure, internal and external, mobile, public and private, Internet, Intranet and call centres."},"Testing":{"code":"TEST","levels":{"1":"Executes given test scripts under supervision. Records results and reports issues. Develops an understanding of the role of testing within system development, as a tool for design improvement as well as a validation process.","2":"Defines test conditions for given requirements. Designs test cases and creates test scripts and supporting data, working to the specifications provided. Interprets, executes and records test cases in accordance with project test plans. Analyses and reports test activities and results. Identifies and reports issues and risks.","3":"Reviews requirements and specifications, and defines test conditions. Designs test cases and test scripts under own direction, mapping back to pre-determined criteria, recording and reporting outcomes. Analyses and reports test activities and results. Identifies and reports issues and risks associated with own work.","4":"Accepts responsibility for creation of test cases using own in-depth technical analysis of both functional and non-functional specifications (such as reliability, efficiency, usability, maintainability and portability). Creates traceability records, from test cases back to requirements. Produces test scripts, materials and regression test packs to test new and amended software or services. Specifies requirements for environment, data, resources and tools. Interprets, executes and documents complex test scripts using agreed methods and standards. Records and analyses actions and results, and maintains a defect register. Reviews test results and modifies tests if necessary. Provides reports on progress, anomalies, risks and issues associated with the overall project. Reports on system quality and collects metrics on test cases. Provides specialist advice to support others.","5":"Coordinates and manages planning of the system and\/or acceptance tests,  including software security testing, within a development or integration project or programme. Takes responsibility for integrity of testing and acceptance activities and coordinates the execution of these activities. Provides authoritative advice and guidance on any aspect of test planning and execution. Defines and communicates the test strategy for the project. Manages all test processes, including test plans, resources, costs, timescales, test deliverables and traceability. Manages client relationships with respect to testing matters. Identifies process improvements, and contributes to corporate testing standards and definition of best practice.","6":"Determines testing policy, and owns the supporting processes including software security testing. Takes responsibility for the management of all testing activities within a development or integration project or programme. Manages all risks associated with the testing and takes preventative action when any risks become unacceptable. Assesses and advises on the practicality of testing process alternatives, including automated testing. Initiates improvements to test processes and directs their implementation. Assesses suppliers’ development and testing capabilities. Determines project testing standards for all phases, influencing all parties to conform to those standards. Manages client relationships with respect to all testing matters."},"description":"The planning, design, management, execution and reporting of tests, using appropriate testing tools and techniques and conforming to agreed process standards and industry specific regulations. The purpose of testing is to ensure that new and amended systems, configurations, packages, or services, together with any interfaces, perform as specified (including security requirements) , and that the risks associated with deployment are adequately understood and documented. Testing includes the process of engineering, using and maintaining testware (test cases, test scripts, test reports, test plans, etc) to measure and improve the quality of the software being tested."},"Safety engineering":{"code":"SFEN","levels":{"3":"Assists with the collection of safety assurance evidence, undertaking all work in accordance with agreed safety, technical and quality standards, using appropriate methods and tools. Documents the results of hazard and risk analysis activities.","4":"Contributes to the identification, analysis and documentation of hazards, and to the capture, evaluation and specification of safety requirements. Analyses and documents safety validation results. Contributes to the development and maintenance of project safety assurance plans, and gathers safety assurance evidence for safety case preparation.","5":"Identifies and analyses hazards and contributes to the identification and evaluation of risk reduction measures, ensuring these are adequately documented. Specifies safety-related systems architectures up to the highest safety integrity levels. Develops and maintains project safety assurance plans, monitors compliance and ensures that safety assurance evidence is gathered for safety case preparation.","6":"Takes full responsibility for hazard analysis and risk assessment, safety-related system architectural design, safety assurance planning and compliance and safety case preparation on systems up to the highest safety integrity levels. Takes responsibility for the safety-related aspects of multiple complex or high safety integrity level projects, providing effective leadership to team members."},"description":"The application of appropriate methods to assure safety during all lifecycle phases of safety-related systems developments, including maintenance and re-use. These include safety hazard and risk analysis, safety requirements specification, safety-related system architectural design, formal method design, safety validation and verification, and safety case preparation."},"Information content authoring":{"code":"INCA","levels":{"1":"Contributes, under instruction, to the generation of content, and to configuration of content items and files. Executes pre-planned testing activities under supervision, recording findings.","2":"Develops an understanding of content development and authoring activities, such as information gathering, creating draft content, identifying appropriate illustrations, and proper treatment of copyright and considering the publication medium(s). Works with colleagues and clients to understand audience needs and to assimilate source material. Creates draft materials that present information clearly, concisely and accurately in appropriate plain language, which meets the requirements of the audience(s) as clearly, simply and quickly as possible. Applies guidelines and standards to moderate content from others, escalating where appropriate.","3":"Liaises with clients and representatives of the intended audience(s) to clarify detailed requirements. Designs, creates, controls and evaluates moderately-complex subject matter ensuring the needs of the audience(s) are met in a manner appropriate to the medium(s) in use. Makes informed decisions about the best way to present information to the audience(s), taking into consideration how information may be presented, identified, and searched for. Produces information artefacts that are accurate, current, relevant and easily understood by the intended audience(s). Applies moderation and editing processes to content supplied by others.","4":"Controls, monitors and evaluates content to ensure quality, consistency and accessibility of messages. Designs the content and appearance of complex information deliverables (for example, collections of artefacts, which maybe spread across multiple mediums) in collaboration with clients and\/or representatives of the intended audience(s). Moderates content (in both draft and published forms) and ensures content can be re-purposed appropriately. Creates and evaluates complex, well-engineered deliverables, ensuring alignment with the agreed requirements, making optimal use of the chosen medium(s). Reviews work of other content designers and authors for consistency and accuracy, and takes responsibility for ensuring appropriate publication. Understands the implications of publishing content and manages the associated risks.","5":"Provides overall editorial control across the team or teams of content designers and authors, to ensure appropriate content, tone, brevity, consistency and re-use. Advises on appropriate content formats and mediums, and oversees the review and approval of materials to enable requirements to be satisfied. Develops and maintains content plans showing how the identified audience needs will be met.","6":"Oversees content development activities, ensuring that adequate procedures, standards, tools and resources are in place and implemented to ensure the appropriate quality of material developed by content creators within the organisation. Champions the use of clear language and sets the quality standards for drafting and final copy. Manages relationships with stakeholders, ensuring they receive the information they need."},"description":"The application of the principles and practices of authoring, designing, controlling, and presenting textual information (supported where necessary by graphical content) to meet the requirements of intended audience(s). This information may be delivered via digital, print, or other medium. Management of the authoring process and the interaction with editorial and publication processes."}},"User experience":{"User research":{"code":"URCH","levels":{"3":"Applies standard methods in support of user research initiatives. Involves wider team in research activities. Engages effectively with users and customer representatives to generate high quality research. Documents and shares the outcomes of user research.","4":"Executes generative research in order to find opportunities for innovation in, and enhancement of, systems, products and services. Collects and analyses data related to people’s behaviours, needs, and opinions. Supports synthesis of findings and the creation of insights, reports and presentations to inform decision making and drive actions. Contributes to selection of the user research approaches for projects and initiatives and plans own user research activities. Supports adoption of agreed approaches. Contributes to the development of organisational methods and standards for user research. Facilitates input from users and stakeholders. Provides constructive challenge and enables effective  prioritisation of requirements.","5":"Determines the approaches to be used for encouraging user engagement in generative research in order to find opportunities for innovation in, and enhancement of, systems, products and services. Leads the collection and analysis of data related to people’s behaviours, needs, and opinions. Synthesises findings, develops insights and presents findings to inform decision making and drive actions. Plans and drives the user research activities providing expert advice and guidance to support adoption of agreed approaches. Contributes to the development of organisational methods and standards for user  research.","6":"Champions user-centred design and secures organisational commitment to the significant involvement of users in research to achieve a deep understanding of their current and future needs. Develops organisational policies, standards, and guidelines to ensure research continually informs the development of systems, interactions, products and services to optimise utility and usability for users and enable them to achieve their required outcomes. Develops or sources organisational resources and capabilities to facilitate adoption and exploitation of user research, including specialist user-centred facilities and user communities. Collaborates with internal and external partners to facilitate effective user research."},"description":"The identification of users’ behaviours, needs and motivations  through ethnography, observation techniques, task analysis, and other methodologies that incorporate both the social and technological context. Taking an approach that incorporates significant involvement of users in research to generate deep understanding and uncover new opportunities for systems, products and services. The quantification of different user populations and their needs, identifying target users and segments in order to maximise the chances of design success for systems, products and services. The inclusion of a range of users in research activities to capture the diversity of users of the organisation’s systems, products and services and the imperative to make these usable and accessible for everyone."},"User experience analysis":{"code":"UNAN","levels":{"3":"Creates and describes personas to represent key user segments. Describes users’ goals and tasks and the environment within which the system, product or service will be used. Selects appropriate techniques for the elicitation of detailed user experience requirements. Identifies and defines user experience and user accessibility requirements. Works with stakeholders to prioritise requirements and resolve conflicts.","4":"Identifies and describes the user objectives for systems, products and services. Identifies the roles of affected stakeholder groups. Defines the required behaviour and performance of the system, product or service in terms of the total user experience, resolving potential conflicts between differing user requirements. Specifies measurable criteria for the required usability and accessibility of the system, products and services.","5":"Determines the approaches to be used to analyse, clarify and communicate the user experience, users’ characteristics and tasks, and the technical, social, organisational and physical environment in which systems, products or services will operate. Plans and drives user experience and accessibility analysis activities providing expert advice and guidance to support adoption of agreed approaches."},"description":"The identification, analysis, clarification and communication of the context of use in which applications will operate, and of the goals of  products, systems or services. Analysis and prioritisation of stakeholders’ user experience needs and definition of required system, product or service attributes, behaviour and performance. The definition and management of user experience and user accessibility requirements for all potential users."},"User experience design":{"code":"HCEV","levels":{"3":"Applies tools and methods to design and develop users’ digital and off-line tasks, interactions and interfaces to meet agreed usability and accessibility requirements for selected system, product or service components. Creates workable prototypes. Assists, as part of a team, on overall user experience design. Assists in the evaluation of design options and trade-offs. Consistently applies visual design and branding guidelines.","4":"Designs and develop users’ digital and off-line tasks, interaction and interfaces to meet agreed usability and accessibility requirements. Translates concepts into outputs and prototypes and captures user feedback to improve designs. Specifies appropriate tools, methods and design patterns. Evaluates alternative design options and recommends designs taking into account performance, usability and accessibility requirements. Interprets and follows visual design and branding guidelines to create consistent and impactful user experience.","5":"Determines the approaches to be used to design and prototype digital and off-line tasks, interactions and interfaces in line with the usability and accessibility requirements of the system, product or service. Uses iterative approaches to rapidly incorporate user feedback into designs. Plans and drives user experience design activities providing expert advice and guidance to support adoption of agreed approaches. Integrates required visual design and branding into the user experience design activities.","6":"Obtains organisational commitment to policies, standards, and strategies to deliver required usability, accessibility and security. Specifies user experience design standards and methods to meet organisational objectives for systems, products and services and combining digital and off-line experiences. Plans and leads user experience design activities for strategic, large and complex programmes."},"description":"The process of iterative design to enhance user satisfaction by improving the usability and accessibility provided when interacting with a system, product or service. The design of users’ digital and offline tasks, interactions and interfaces to meet usability and accessibility requirements. The refinement of designs in response to user-centred evaluation and feedback and communication of the design to those responsible for design, development and implementation."},"User experience evaluation":{"code":"USEV","levels":{"2":"Assists in preparations for evaluation of systems, products or services, and in the operation of the environment, facilities tools needed for effective evaluations. Assists in collection of feedback on prototypes and designs from users and others. Maintains the environment.","3":"Evaluates design options and prototypes to obtain user feedback on requirements of developing systems, products or services. Tests the usability and accessibility of components and alternative designs. Administers a range of evaluations, recording data and feedback. Analyses evaluation data and recommend actions. Checks systems, products or services for adherence to applicable standards, guidelines, style guides, and legislation. Evaluates the usability of existing or competitor systems to provide benchmark values and as input to design.","4":"Plans and performs all types of user experience evaluation to check and confirm that usability and accessibility requirements have been met. Selects appropriate use of formative or summative evaluations. Facilitates both moderated and unmoderated usability tests. Evaluates prototypes or designs of systems, products or services  against the agreed usability and accessibility specifications. Interprets and presents results of evaluations and prioritises issues. Checks systems, products, or services which are in-use for changes in usability and accessibility needs and to ensure that these needs continue to be met. Assesses the stability of requirements against changes in context of use.","5":"Manages user experience evaluation of systems, products or services, to assure that the usability and accessibility requirements have been met, required practice has been followed, and systems in use continue to meet organisational and user needs. Advises on what to evaluate and the type of evaluation to use and the extent of user involvement required. Works iteratively with design teams to ensures that the results of evaluations are understood and acted upon by designers and developers of systems, products and services. Advises on achievement of required usability and accessibility levels of specific designs or prototypes.","6":"Champions high standards in all aspects of the interaction between users and the organisation’s systems, products and services including involvement of users in evaluation activities. Specifies standards and methods to achieve organisational objectives for usability and accessibility and to ensure that this is addressed in future design. Develops or sources organisational resources and capabilities  to conduct effective user experience evaluation including specialist user-centred facilities, communities of users. Collaborates with internal and external partners to facilitate effective evaluation of systems, products and services."},"description":"Validation of systems, products or services, to assure that the stakeholder and organisational requirements have been met, required practice has been followed, and systems in use continue to meet organisational and user needs. Iterative assessment (from early prototypes to final live implementation) of effectiveness, efficiency, user satisfaction, health and safety, and accessibility to measure or improve the usability of new or existing processes, with the intention of achieving optimum levels of product or service usability."}},"Installation and integration":{"Systems integration and build":{"code":"SINT","levels":{"2":"Produces software builds from software source code. Conducts tests as defined in an integration test specification, records the details of any failures. Analyses and reports on integration test activities and results. Identifies and reports issues and risks.","3":"Defines the software modules needed for an integration build and produces a build definition for each generation of the software. Accepts completed software modules, ensuring that they meet defined criteria. Produces software builds from software source code for loading onto target hardware. Configures the hardware and software environment as required by the system being integrated. Produces integration test specifications, conducts tests and records and reports on outcomes. Diagnoses faults and records and reports on the results of tests. Produces system integration reports.","4":"Provides technical expertise to enable the configuration of software, other system components and equipment for systems testing. Collaborates with technical teams to develop and agree system integration plans and report on progress. Defines complex\/new integration builds. Ensures that integration test environments are correctly configured. Designs, performs and reports results of tests of the integration build. Identifies and documents system integration components for recording in the configuration management system. Recommends and implements improvements to processes and tools.","5":"Identifies, evaluates and manages the adoption of appropriate tools, techniques and processes (including automation and continuous integration) to create a robust integration framework. Leads integration work in line with the agreed system and service design. Monitors and reports on the results of each integration and build. Designs and builds integration components and interfaces. Contributes to the overall design of the service and the definition of criteria for product and component selection. Contributes to development of systems integration policies, standards and tools.","6":"Develops organisational policies, standards, and guidelines for systems integration and build. Leads the development of organisational capabilities for systems integration and build including automation and continuous integration. Provides resources to ensure systems integration and build can operate effectively and ensure  adoption and adherence to policies and standards."},"description":"The planning, implementation and control of activities to integrate\/build components, subsystems and interfaces to create operational systems, products or services for delivery to customers, or for internal or interim purposes such as testing. The development of organisational capabilities for systems integration and build including automation and continuous integration."},"Porting\/software configuration":{"code":"PORT","levels":{"3":"Assists in the configuration of software and equipment and the systems testing of platform-specific versions of one or more software products. Documents faults, implements resolutions and retests to agreed standards.","4":"Configures software and equipment and tests platform-specific versions of one or more software products. Reports the outcome of testing and identifies potential improvements to the process and to the software products according to agreed designs and standards.","5":"Leads a team, providing expert technical knowledge in the systems testing of platform-specific versions of the software products, on varying platforms. Provides specialist guidance information to support, systems testing and quality assurance functions to assist in improving procedures.","6":"Ensures the availability of hardware, software, and resources for the systems testing of platform-specific versions of one or more software products. Defines configurations required for testing with reference to agreed testing standards. Evaluates new developments in the organisation and the industry and advises senior management on potential growth, problem areas and resourcing needs. Ensures adherence to agreed standards and good practice."},"description":"The configuration of software products into new or existing software environments\/platforms."},"Hardware design":{"code":"HWDE","levels":{"4":"Designs computing and communications equipment, taking account of target environment, performance, security and sustainability requirements. Translates logical designs into physical designs, and delivers technical prototypes of proposed components for approval by customer and execution by technicians. Designs tests to measure performance of prototypes and production output against specification and inform iterative development.","5":"Specifies and designs complex hardware components\/ systems. Selects appropriate design standards, methods and tools, consistent with agreed enterprise policies, and ensures they are applied effectively. Reviews others’ designs to ensure selection of appropriate technology, efficient use of resources, and effective integration of multiple systems and technology. Contributes to policy for selection of components. Evaluates and undertakes impact analysis on major design options and assesses and manages associated risks. Ensures that hardware designs balance functional, service quality, security, systems management and sustainability requirements.","6":"Controls hardware design practice within an enterprise. Influences industry-based models for the development of new technology components. Develops effective procurement strategies, consistent with business needs. Ensures adherence to that relevant technical strategies, policies, standards and practices."},"description":"The specification and design of computing and communications equipment (such as semiconductor processors, HPC architectures and DSP and graphics processor chips), typically for integration into, or connection to an IT infrastructure or network. The identification of concepts and their translation into implementable design. The selection and integration, or design and prototyping of components. The adherence to industry standards including compatibility, security and sustainability."},"Systems installation\/decommissioning":{"code":"HSIN","levels":{"1":"Following agreed procedures, performs simple installations, replaces consumable items, checks correct working of installations, and documents and reports on work done.","2":"Installs or removes hardware and\/or software, and associated connections, using supplied installation instructions and tools. Conducts tests and corrects malfunctions. Documents results in accordance with agreed procedures. Assists with the evaluation of change requests. Contributes, as required, to investigations of problems and faults concerning the installation of hardware and\/or software and confirms the correct working of installations.","3":"Installs or removes hardware and\/or software, using supplied installation instructions and tools including, where appropriate, handover to the client. Conducts tests, corrects malfunctions, and documents results in accordance with agreed procedures. Reports details of all hardware\/software items that have been installed and removed so that configuration management records can be updated. Provides assistance to users in a professional manner following agreed procedures for further help or escalation. Reviews change requests. Maintains accurate records of user requests, contact details and outcomes. Contributes to the development of installation procedures and standards.","4":"Undertakes routine installations and de-installations of items of hardware and\/or software. Takes action to ensure targets are met within established safety and quality procedures, including, where appropriate, handover to the client. Conducts tests of hardware and\/or software using supplied test procedures and diagnostic tools. Corrects malfunctions, calling on other experienced colleagues and external resources if required. Documents details of all hardware\/software items that have been installed and removed so that configuration management records can be updated. Develops installation procedures and standards, and schedules installation work. Provides specialist guidance and advice to less experienced colleagues to ensure best use is made of available assets, and to maintain or improve the installation service.","5":"Takes responsibility for installation projects, providing effective team leadership, including information flow to and from the customer during project work. Develops and implements quality plans and method statements. Monitors the effectiveness of installations and ensures that appropriate recommendations for change are made."},"description":"The installation, testing, implementation or decommissioning and removal of cabling, wiring, equipment, hardware and associated software, following plans and instructions and in accordance with agreed standards. The testing of hardware and software components, resolution of malfunctions, and recording of results. The reporting of details of hardware and software installed so that configuration management records can be updated."}}},"Delivery and operation":{"Service design":{"Availability management":{"code":"AVMT","levels":{"4":"Contributes to the availability management process and its operation and performs defined availability management tasks. Analyses service and component availability, reliability, maintainability and serviceability. Ensures that services and components meet and continue to meet all of their agreed performance targets and service levels. Implements arrangements for disaster recovery and documents recovery procedures. Conducts testing of recovery procedures.","5":"Provides advice, assistance and leadership associated with the planning, design and improvement of service and component availability, including the investigation of all breaches of availability targets and service non-availability, with the instigation of remedial activities. Plans arrangements for disaster recovery together with supporting processes and manages the testing of such plans.","6":"Sets policy and develops strategies, plans and processes for the design, monitoring, measurement, maintenance, reporting and continuous improvement of service and component availability, including the development and implementation of new availability techniques and methods."},"description":"The definition, analysis, planning, measurement, maintenance and improvement of all aspects of the availability of services, including the availability of power. The overall control and management of service availability to ensure that the level of service delivered in all services is matched to or exceeds the current and future agreed needs of the business, in a cost effective manner."},"Service level management":{"code":"SLMO","levels":{"2":"Monitors and logs the actual service provided, compared to that required by service level agreements.","3":"Monitors service delivery performance metrics and liaises with managers and customers to ensure that service level agreements are not breached without the stakeholders being given the opportunity of planning for a deterioration in service.","4":"Performs defined tasks to monitor service delivery against service level agreements and maintains records of relevant information. Analyses service records against agreed service levels regularly to identify actions required to maintain or improve levels of service, and initiates or reports these actions.","5":"Ensures that service delivery meets agreed service levels. Creates and maintains a catalogue of available services. In consultation with the customer negotiates service level requirements and agrees service levels. Diagnoses service delivery problems and initiates actions to maintain or improve levels of service. Establishes and maintains operational methods, procedures and facilities in assigned area of responsibility and reviews them regularly for effectiveness and efficiency.","6":"Ensures that a catalogue of available services is created and maintained and that service level agreements are complete and cost effective. Ensures that service delivery is monitored effectively and that identified actions to maintain or improve levels of service are implemented. Ensures that operational methods, procedures, facilities and tools are established, reviewed and maintained. Negotiates with relevant parties in respect of disruptions and major amendments to the provision of services. Reviews service delivery to ensure that agreed targets are met and prepares proposals to meet forecast changes in the level or type of service.","7":"Sets strategies for service delivery that support the strategic needs of the client organisation. Authorises allocation of resources for monitoring service delivery arrangements. Provides leadership within the industry on the identification of future trends (for example, technical, market, industrial, socioeconomic, legislative). Develops relationships with customers at the highest level to identify potential areas of mutual commercial interest for future development, maintains an overview of the contribution of service delivery arrangements to organisational success."},"description":"The planning, implementation, control, review and audit of service provision, to meet customer business requirements. This includes negotiation, implementation and monitoring of service level agreements, and the ongoing management of operational facilities to provide the agreed levels of service, seeking continually and proactively to improve service delivery and sustainability targets."}},"Service transition":{"Service acceptance":{"code":"SEAC","levels":{"4":"Engages with project management to confirm that products developed meet the service acceptance criteria and are to the required standard. Feeds into change management processes.","5":"Engages with technical design and project managers or Project Management Office, to ensure correct products are produced, in a timely fashion. Evaluates the quality of project outputs against agreed service acceptance criteria.","6":"Owns the transition process, develops the organisation’s approach and defines the acceptance criteria for service transition. Promotes and monitors project quality outputs to ensure they are fit for purpose and fit for use within operational service. Actively engages with technical design and project managers to promote awareness and compliance with service transition quality plans and processes. Agrees the service acceptance criteria with project\/programme managers."},"description":"The achievement of formal confirmation that service acceptance criteria have been met, and that the service provider is ready to operate the new service when it has been deployed. (Service acceptance criteria are used to ensure that a service meets the defined service requirements, including functionality, operational support, performance and quality requirements)."},"Configuration management":{"code":"CFMG","levels":{"2":"Applies tools, techniques and processes to administer, track, log, report on and correct configuration items, components and changes. Assists with audits to check the accuracy of information and undertakes any necessary corrective action under direction.","3":"Applies tools, techniques and processes to track, log and correct information related to configuration items. Verifies and approves changes ensuring protection of assets and components from unauthorised change, diversion and inappropriate use. Ensures that users comply with identification standards for object types, environments, processes, lifecycles, documentation, versions, formats, baselines, releases and templates. Performs audits to check the accuracy of information and undertakes any necessary corrective action under direction.","4":"Proposes and agrees the configuration items (CIs) to be uniquely identified with naming conventions. Ensures that operational processes are in place to maintain secure configuration, consistent classification and management of CIs, and for the verification and audit of configuration records. Develops, configures and maintains tools (including automation) to identify, track, log and maintain accurate, complete and current information. Reports on the status of configuration management. Identifies problems and issues and recommend corrective actions.","5":"Agrees scope of configuration management processes and the configuration items (CIs) and related information to be controlled. Identifies, evaluates and manages the adoption of appropriate tools, techniques and processes (including automation) for configuration management to ensure information is complete, current and accurate. Plans the capture and management of CIs and related information. Contributes to development of configuration management strategies, policies, standards, and guidelines.","6":"Develops configuration management strategies, policies, standards, and guidelines. Champions the importance and value of configuration management and develops new methods and organisational capabilities (including automation) for configuration management. Provides resources to drive adoption of, and adherence to, policies and standards. Measures and monitors adherence to standards and ensures consistent execution of the process across the organisation."},"description":"The planning, management, control and governance of organisational, project and service assets and artefacts. The identification, classification and specification of configuration items (CIs) and their inter-relationships. Identifying the configuration and version of source code, software, systems, documents and service dependent CIs at distinct points in time. Systematically controlling changes to the configuration and maintaining the integrity and traceability of the configuration throughout the project, system and\/or service life cycle. Identifying and documenting the functional and physical characteristics of CIs, controlling changes to those characteristics, recording and reporting change processing and implementation status. Verifying and auditing CIs for data quality and compliance with specified internal and external requirements."},"Asset management":{"code":"ASMG","levels":{"2":"Uses agreed procedures to create and maintain an accurate register of assets. Performs activities related to administration of assets. Produces routine reports to assist asset management activities and decision making.","3":"Applies tools, techniques and processes to create and maintain an accurate asset register. Produces reports and analysis to support asset management activities and aid decision making.","4":"Controls IT assets in one or more significant areas, ensuring that administration of the acquisition, storage, distribution, movement and disposal of assets is carried out. Produces and analyses registers and histories of authorised assets (including secure master copies of software, documentation, data, licenses and agreements for supply, warranty and maintenance), and verifies that all these assets are in a known state and location. Acts to highlight and resolve potential instances of unauthorised assets such as unlicensed copies of software.","5":"Manages and maintains the service compliance of all IT and service assets in line with business and regulatory requirements involving knowledge of financial and technical processes, tools and techniques. Identifies, assesses and communicates associated risks. Ensures asset controllers, infrastructure teams and the business co-ordinate and optimise value, maintain control and maintain appropriate legal compliance.","6":"Promotes the continuing economic and effective provision of services, ensuring that all changes to assets and services are appropriately and accurately controlled and recorded. Provides information and advice on issues such as maintenance of hardware assets, licensing of software, protection of intellectual property, and legal obligations. Promotes awareness of and commitment to asset control. Initiates assessment of consequences and risks arising from decisions to obtain, change or continue the possession or use of an asset, system or service."},"description":"The management of the lifecycle for all managed assets (hardware, software, intellectual property, licences, warranties etc) including security, inventory, compliance, usage and disposal, aiming to protect and secure the corporate assets portfolio, optimise the total cost of ownership and sustainability by minimising operating costs, improving investment decisions and capitalising on potential opportunities. Knowledge and use of international standards for asset management and close integration with security, change, and configuration management are examples of enhanced asset management development."},"Change management":{"code":"CHMG","levels":{"2":"Documents changes based on requests for change. Applies change control procedures.","3":"Develops, documents and implements changes based on requests for change. Applies change control procedures.","4":"Assesses, analyses, develops, documents and implements changes based on requests for change.","5":"Develops implementation plans for complex requests for change. Evaluates risks to the integrity of service environment inherent in proposed implementations (including availability, performance, security and compliance of the business services impacted). Seeks authority for those activities, reviews the effectiveness of change implementation, suggests improvement to organisational procedures governing change management. Leads the assessment, analysis, development, documentation and implementation of changes based on requests for change.","6":"Sets the organisation’s policy for the management of change in live services and test environments. Ensures effective control and treatment of risk to the availability, performance, security and compliance of the business services impacted."},"description":"The management of change to the service infrastructure including service assets, configuration items and associated documentation. Change management uses requests for change (RFC) for standard or emergency changes, and changes due to incidents or problems to provide effective control and reduction of risk to the availability, performance, security and compliance of the business services impacted by the change."},"Release and deployment":{"code":"RELM","levels":{"3":"Uses the tools and techniques for specific areas of release and deployment activities. Administers the recording of activities, logging of results and documents technical activity undertaken. May carry out early life support activities such as providing support advice to initial users.","4":"Assesses and analyses release components. Provides input to scheduling. Carries out the builds and tests in coordination with testers and component specialists maintaining and administering the tools and methods – manual or automatic - and ensuring, where possible, information exchange with configuration management. Ensures release processes and procedures are maintained.","5":"Leads the assessment, analysis, planning and design of release packages, including assessment of risk. Liaises with business and IT partners on release scheduling and communication of progress. Conducts post release reviews. Ensures release processes and procedures are applied and that releases can be rolled back as needed. Identifies, evaluates and manages the adoption of appropriate release and deployment tools, techniques and processes (including automation).","6":"Sets the release policy for the organisation in the context of both development and production\/operations. Ensures that management processes, tools, techniques and resources (including automation) are in place to ensure that the transition of services, service components and packages are planned and compliant and that test and validation and configuration management are partnered in all release and deployment activities. Provides authorisation for critical release activity and point of escalation."},"description":"The management of the processes, systems and functions to package, build, test and deploy changes and updates (which are bounded as “releases”) into a live environment, establishing or continuing the specified service, to enable controlled and effective handover to operational management and the user community. The application of automation to improve the efficiency and quality of releases."}},"Service operation":{"System software":{"code":"SYSP","levels":{"3":"Uses system management software and tools to collect agreed performance statistics. Carries out agreed system software maintenance tasks.","4":"Reviews system software updates and identifies those that merit action. Tailors system software to maximise hardware functionality. Installs and tests new versions of system software. Investigates and coordinates the resolution of potential and actual service problems. Prepares and maintains operational documentation for system software. Advises on the correct and effective use of system software.","5":"Evaluates new system software, reviews system software updates and identifies those that merit action. Ensures that system software is tailored to facilitate the achievement of service objectives. Plans the installation and testing of new versions of system software. Investigates and coordinates the resolution of potential and actual service problems. Ensures that operational documentation for system software is fit for purpose and current. Advises on the correct and effective use of system software."},"description":"The provision of specialist expertise to facilitate and execute the installation and maintenance of system software such as operating systems, data management products, office automation products and other utility software."},"Capacity management":{"code":"CPMG","levels":{"4":"Monitors service component capacity and initiates actions to resolve any shortfalls according to agreed procedures. Applies techniques to control the demand upon a particular resource or service. Contributes to capacity modelling and planning. Supports the design of service component capacity.","5":"Manages capacity modelling and forecasting activities. Pro-actively reviews information in conjunction with service level agreements to identify any capacity issues and specifies any required changes. Provides advice to support the design of service components including designing in flexible and scalable capacity. Works with business representatives to agree and implement short- and medium-term modifications to capacity. Drafts and maintains standards and procedures for service component capacity management. Ensures the correct implementation of standards and procedures.","6":"Develops policy and strategies to ensure all the performance measures of IT services meet the needs of the business and performs to any service requirements or service level agreements which may be in place. Leads capacity modelling and forecasting over the organisation’s planning or budgeting cycle. Ensures that the policies and standards for capacity management are fit for purpose, current and are correctly implemented. Reviews new business proposals and provides specialist advice on capacity issues."},"description":"The planning, design and management of the capability, functionality and sustainability of service components (including hardware, software, network resources and software\/infrastructure as a Service) to meet current and forecast needs in a cost-efficient manner aligned to the business. The modelling of both long-term changes and short-term variations in the level of capacity required to execute the service. The deployment of techniques to control the demand and add\/reduce capacity in a cost effective, timely manner to meet changes in demand."},"Security administration":{"code":"SCAD","levels":{"1":"Performs simple security administration tasks. Maintains relevant records and documentation.","2":"Receives and responds to routine requests for security support. Maintains records and advises relevant persons of actions taken. Assists in the investigation and resolution of issues relating to access controls and security systems.","3":"Investigates minor security breaches in accordance with established procedures. Assists users in defining their access rights and privileges. Performs non-standard security administration tasks and resolves security administration issues.","4":"Maintains security administration processes and checks that all requests for support are dealt with according to agreed procedures. Provides guidance in defining access rights and privileges. Investigates security breaches in accordance with established procedures and recommends required actions and supports \/ follows up to ensure these are implemented.","5":"Monitors the application and compliance of security administration procedures and reviews information systems for actual or potential breaches in security. Ensures that all identified breaches in security are promptly and thoroughly investigated and that any system changes required to maintain security are implemented. Ensures that security records are accurate and complete and that request for support are dealt with according to set standards and procedures. Contributes to the creation and maintenance of policy, standards, procedures and documentation for security.","6":"Develops policies, standards, processes, guidelines for ensuring the physical and electronic security of automated systems. Ensures that the policy and standards for security administration are fit for purpose, current and are correctly implemented. Reviews new business proposals and provides specialist advice on security issues and implications."},"description":"The provision of operational security management and administrative services. Typically includes the authorisation and monitoring of access to IT facilities or infrastructure, the investigation of unauthorised access and compliance with relevant legislation."},"Penetration testing":{"code":"PENT","levels":{"4":"Maintains current knowledge of malware attacks, and other cyber security threats. Creates test cases using in-depth technical analysis of risks and typical vulnerabilities. Produces test scripts, materials and test packs to test new and existing software or services. Specifies requirements for environment, data, resources and tools. Interprets, executes and documents complex test scripts using agreed methods and standards. Records and analyses actions and results. Reviews test results and modifies tests if necessary. Provides reports on progress, anomalies, risks and issues associated with the overall project. Reports on system quality and collects metrics on test cases. Provides specialist advice to support others.","5":"Coordinates and manages planning of penetration tests, within a defined area of business activity. Delivers objective insights into the existence of vulnerabilities, the effectiveness of defences and mitigating controls - both those already in place and those planned for future implementation. Takes responsibility for integrity of testing activities and coordinates the execution of these activities. Provides authoritative advice and guidance on the planning and execution of vulnerability tests. Defines and communicates the test strategy. Manages all test processes, and contributes to corporate security testing standards.","6":"Takes a comprehensive approach to seeking vulnerabilities across the full spectrum of organisation policies, processes, and defences in order to improve organisational readiness, improve training for defensive practitioners, and inspect current performance levels. Determines testing policy, and owns the supporting processes. Takes responsibility for the management of all vulnerability testing activities within the organisation. Assesses and advises on the practicality of testing process alternatives. Initiates improvements to test processes and directs their implementation. Assesses suppliers’ development and testing capabilities. Manages client relationships with respect to all testing matters."},"description":"The assessment of organisational vulnerabilities through the design and execution of penetration tests that demonstrate how an adversary can either subvert the organisation’s security goals  or achieve specific adversarial objectives. Penetration testing may be a stand-alone activity or an aspect of acceptance testing prior to an approval to operate. The identification of deeper insights into the business risks of various vulnerabilities."},"Radio frequency engineering":{"code":"RFEN","levels":{"2":"Assists with setting up, tuning and functional checks of radio frequency\/analogue elements. Resolves faults down to line replaceable unit (LRU) level or escalates according to given procedures. Carries out user confidence checks and escalates faults according to given procedures.","3":"Deploys, sets up, tunes and calibrates radio frequency\/analogue elements following maintenance schedules and using appropriate tools and test equipment. Incorporates hardware\/firmware modifications. Interprets automatic fault\/performance indications and resolves faults down to discrete component level or escalates according to given procedures.","4":"Investigates and resolves system-wide fault conditions using a wide range of diagnostic tools and techniques. Reconfigures equipment to circumvent temporary outages.","5":"Develops maintenance schedules and procedures. Approves equipment upgrades and modifications. Monitors system performance, recommends equipment modifications and changes to operating procedures, servicing methods and schedules.","6":"Specifies radio frequency equipment performance requirements and sets maintenance policy."},"description":"The deployment, integration, calibration, tuning and maintenance of radio frequency (RF) and analogue elements of IT systems."},"Application support":{"code":"ASUP","levels":{"2":"Assists in the investigation and resolution of issues relating to applications. Assists with specified maintenance procedures.","3":"Identifies and resolves issues with applications, following agreed procedures. Uses application management software and tools to collect agreed performance statistics. Carries out agreed applications maintenance tasks.","4":"Maintains application support processes, and checks that all requests for support are dealt with according to agreed procedures. Uses application management software and tools to investigate issues, collect performance statistics and create reports.","5":"Drafts and maintains procedures and documentation for applications support. Manages application enhancements to improve business performance. Advises on application security, licensing, upgrades, backups, and disaster recovery needs. Ensures that all requests for support are dealt with according to set standards and procedures."},"description":"The provision of application maintenance and support services, either directly to users of the systems or to service delivery functions. Support typically includes investigation and resolution of issues and may also include performance monitoring. Issues may be resolved by providing advice or training to users, by devising corrections (permanent or temporary) for faults, making general or site-specific modifications, updating documentation, manipulating data, or defining enhancements Support often involves close collaboration with the system’s developers and\/or with colleagues specialising in different areas, such as Database administration or Network support."},"IT infrastructure":{"code":"ITOP","levels":{"1":"Contributes, under supervision, to infrastructure operation.","2":"Carries out agreed operational procedures of a routine nature. Contributes to maintenance, installation and problem resolution.","3":"Carries out agreed operational procedures, including infrastructure configuration, installation and maintenance. Uses infrastructure management tools to collect and report on load and performance statistics and to automate the provisioning, testing and deployment of new and changed infrastructure. Contributes to the implementation of maintenance and installation work. Uses standard procedures and tools to carry out defined system backups, restoring data where necessary. Identifies operational problems and contributes to their resolution.","4":"Provides technical expertise to enable the correct application of operational procedures. Uses infrastructure management tools to determine load and performance statistics. Contributes to the planning and implementation of maintenance and installation work, including building and configuration of infrastructure components in virtualised environments. Implements agreed infrastructure changes and maintenance routines. Configures tools to automate the provisioning, testing and deployment of new and changed infrastructure. Identifies operational problems and contributes to their resolution, checking that they are managed in accordance with agreed standards and procedures. Provides reports and proposals for improvement, to specialists, users and managers."},"description":"The operation and control of the IT infrastructure (comprising physical or virtual hardware, software, network services and data storage) either on-premises or provisioned as cloud services) that is required to deliver and support the information systems needs of a business. Includes preparation for new or changed services, operation of the change process, the maintenance of regulatory, legal and professional standards, the building and management of systems and components in virtualised and cloud computing environments and the monitoring of performance of systems and services in relation to their contribution to business performance, their security and their sustainability. The application of infrastructure management tools to automate the provisioning, testing, deployment and monitoring of infrastructure components."},"Database administration":{"code":"DBAD","levels":{"2":"Assists in database support activities.","3":"Uses database management system software and tools to collect agreed performance statistics. Carries out agreed database maintenance and administration tasks.","4":"Uses database management system software and tools, and knowledge of logical database schemata, to investigate problems and collect performance statistics and create reports. Carries out routine configuration, installation, and reconfiguration of database and related products. Develops and configures tools to enable automation of database administration tasks. Identify problems and issues and recommend corrective actions.","5":"Develops and maintains procedures and documentation for databases. Identifies, evaluates and manages the adoption of appropriate database administration tools and processes, including automation. Contributes to the setting of standards for definition, security and integrity of database objects and ensures conformance to these standards. Manages database configuration including installing and upgrading software and maintaining relevant documentation. Monitors database activity and resource usage. Optimises database performance and plans for forecast resource needs."},"description":"The installation, configuration, upgrade, administration, monitoring and maintenance of databases. Providing support for operational databases in production use and for internal or interim purposes such as iterative developments and testing. Improving the performance of databases and the tools and processes for database administration (including automation)."},"Storage management":{"code":"STMG","levels":{"3":"Performs regular high-performance, scalable backups and restores on a schedule and tracks offsite storage. Carries out documented configuration for allocation of storage, installation and maintenance of secure storage systems as per the agreed operational procedure. Identifies operational problems and contributes to their resolution. Uses standard management and reporting tools to collect and report on storage utilisation, performance and backup statistics.","4":"Reviews capacity, performance, availability and other operational metrics and take appropriate action to ensure corrective and proactive maintenance of storage and backup systems to support the requirement to protect and secure business information. Creates reports and proposals for improvement and contributes to the planning and implementation of new installations and scheduled maintenance and changes within the system. Prepares and maintains operational procedures and provides technical expertise and appropriate information to the management.","5":"Manages the storage and backup systems to provide agreed service levels. Responsible for creating, improving, and supporting quality IT services with optimal utilisation of storage resources, ensuring data security, availability and integrity of business data. Develops standards, procedures and guidelines for implementing data protection and disaster recovery functionality for all business applications and business data using different online and offline storage devices.","6":"Develops strategies for managing storage and data based on level of criticality of information, managing compliance with regulatory and security requirements. Align investments in storage management with data management policies to meet the business goals based on the information value, classification of data, recovery point and recovery time objectives."},"description":"The planning, implementation, configuration and tuning of storage hardware and software covering online, offline, remote and offsite data storage (backup, archiving and recovery) and ensuring compliance with regulatory and security requirements."},"Network support":{"code":"NTAS","levels":{"2":"Assists in investigation and resolution of network problems. Assists with specified maintenance procedures.","3":"Identifies and resolves network problems following agreed procedures. Uses network management software and tools to collect agreed performance statistics. Carries out agreed network maintenance tasks.","4":"Maintains the network support process and checks that all requests for support are dealt with according to agreed procedures. Uses network management software and tools to investigate and diagnose network problems, collect performance statistics and create reports, working with users, other staff and suppliers as appropriate.","5":"Drafts and maintains procedures and documentation for network support. Makes a significant contribution to the investigation, diagnosis and resolution of network problems. Ensures that all requests for support are dealt with according to set standards and procedures."},"description":"The provision of network maintenance and support services. Support may be provided both to users of the systems and to service delivery functions. Support typically takes the form of investigating and resolving problems and providing information about the systems. It may also include monitoring their performance. Problems may be resolved by providing advice or training to users about the network’s functionality, correct operation or constraints, by devising work-arounds, correcting faults, or making general or site-specific modifications."},"Problem management":{"code":"PBMG","levels":{"3":"Investigates problems in systems, processes and services. Assists with the implementation of agreed remedies and preventative measures.","4":"Initiates and monitors actions to investigate and resolve problems in systems, processes and services. Determines problem fixes\/remedies. Assists with the implementation of agreed remedies and preventative measures.","5":"Ensures that appropriate action is taken to anticipate, investigate and resolve problems in systems and services. Ensures that such problems are fully documented within the relevant reporting system(s). Enables development of problem solutions. Coordinates the implementation of agreed remedies and preventative measures. Analyses patterns and trends."},"description":"The resolution (both reactive and proactive) of problems throughout the information system lifecycle, including classification, prioritisation and initiation of action, documentation of root causes and implementation of remedies to prevent future incidents."},"Incident management":{"code":"USUP","levels":{"2":"Following agreed procedures, identifies, registers and categorises incidents. Gathers information to enable incident resolution and promptly allocates incidents as appropriate.","3":"Following agreed procedures, identifies, registers and categorises incidents. Gathers information to enable incident resolution and promptly allocates incidents as appropriate. Maintains records and advises relevant persons of actions taken.","4":"Prioritises and diagnoses incidents according to agreed procedures. Investigates causes of incidents and seeks resolution. Escalates unresolved incidents. Facilitates recovery, following resolution of incidents. Documents and closes resolved incidents according to agreed procedures.","5":"Ensures that incidents are handled according to agreed procedures. Investigates escalated incidents to responsible service owners and seeks resolution. Facilitates recovery, following resolution of incidents. Ensures that resolved incidents are properly documented and closed. Analyses causes of incidents, and informs service owners in order to minimise probability of recurrence, and contribute to service improvement. Analyses metrics and reports on performance of incident management process."},"description":"The processing and coordination of appropriate and timely responses to incident reports, including channelling requests for help to appropriate functions for resolution, monitoring resolution activity, and keeping clients appraised of progress towards service restoration."},"Facilities management":{"code":"DCMA","levels":{"3":"Monitors compliance against agreed processes and investigates, assesses and resolves incidents of non-compliance, escalating where necessary. Grants users required physical accesses and monitors and reports on overall access control.","4":"Uses data centre management tools to produce management information on power, cooling and space and investigate issues where necessary. Carries out routine audit and checks to ensure adherence to policies and procedures. Facilitates the implementation of mandatory electrical safety testing.","5":"Develops and maintains the standards, processes and documentation for data centres. Optimises efficiency in population of data centre space. Ensures adherence to all relevant policies and processes. Uses data centre management tools to plan, record and manage the types of infrastructure installed and the associated power, space and cooling capabilities, usage and actions to meet corporate sustainability targets.","6":"Sets the organisational policy for the management of the IT estate and ensures that policy is reflected using best practice. Develops strategies to ensure future requirements for data centre space can be forecast and fulfilled. Takes overall responsibility for adherence to health & safety regulations and electrical safety policy. Seeks out and ensures use of industry best practice to ensure future plans are aligned to meet corporate sustainability targets."},"description":"The planning, control and management of all the facilities which, collectively, make up the IT estate. This involves provision and management of the physical environment, including space and power allocation, and environmental monitoring to provide statistics on energy usage. Encompasses physical access control, and adherence to all mandatory policies and regulations concerning health and safety at work."}}},"Skills and quality":{"Skill management":{"Learning and development management":{"code":"ETMG","levels":{"3":"Contributes to the maintenance and updates of training records and training catalogue.","4":"Contributes to the development and maintenance of a catalogue of learning and development resources. Books and organises learning events. Updates and controls training records, including attainment of certificates and accreditations.","5":"Manages the provision of learning and development, ensuring optimum use of resources. Maintains, publicises and promotes catalogue of learning and development activities. Ensures that courses are up to date and accredited (when required). Arranges facilities and schedules with learning and development providers as appropriate.","6":"Determines the learning and development programme and delivery mechanisms needed to grow staff skills in line with business needs. Identifies appropriate accreditation and qualification paths, applicable to individuals within the organisation. Evaluates learning outcomes. Manages the development and provision of all learning, taking account of the strategic aims of the employing organisation.","7":"Develops and controls the learning & development strategy for the organisation, ensuring the needs of the organisation are met, both at strategic and tactical level."},"description":"The provision of learning and development processes (including learning management systems) in order to develop the professional, business and\/or technical skills required by the organisation."},"Competency assessment":{"code":"LEDA","levels":{"3":"Performs routine skill\/competency assessments using specified methods and according to specified standards and ethical principles.","4":"Performs routine and non-routine skill\/competency assessments of knowledge, skills and behaviour using specified methods and according to specified standards  aligned with ethical, legal and regulatory requirements. Uses the outcomes of assessments and other data to analyse and evaluate the effectiveness of learning\/educational activities.","5":"Provides advice and guidance on the selection, adoption and adaption of  appropriate assessment methods, tools and techniques based on the context of the assessment and how the results of the assessment are to be used. Manages execution of skill\/competency assessments to ensure they deliver the required outcomes with acceptable quality. Ensures assessments follow ethical, legal and regulatory requirements. Manages reviews of the benefits and value of assessment methods and tools. Identifies and recommends improvements to assessment methods and tools. Assesses the effectiveness of learning or educational activities based on the achievement of skill\/competency development targets.","6":"Champions the importance and value of skills\/competency assessment and of appropriate assessment methods, tools and techniques. Develops organisational policies, standards, and guidelines for skills\/competency assessments  aligned with ethical, legal and regulatory requirements. Leads in the introduction and use of assessment methodologies and tools. Determines the need for internal and\/or external consistency and reliability of assessment outcomes and how this can be achieved across different user groups."},"description":"The assessment of knowledge, skills and behaviours by any means whether formal or informal against frameworks such as SFIA. The evaluation, selection, adoption and adaptation of assessment methods, tools, and techniques based on the context of the assessment and how the results of the assessment are to be used. The evaluation of learning or educational activities against defined skills\/competency development outcomes."},"Learning design and development":{"code":"TMCR","levels":{"3":"Designs, creates, develops, customises and maintains learning materials and resources to deliver agreed outcomes, and meet accreditation requirements if appropriate. Contributes to the design, configuration and testing of learning environments, including creation of simulated data, and replication of external systems, interfaces and assessment systems.","4":"Specifies the content and structure of learning and development materials. Takes responsibility for design, creation, packaging and maintenance and manages development to deliver agreed outcomes. Where required, designs, configures and tests learning environments, including creation of simulated data, and replication of external systems, interfaces, and assessment systems. Secures external accreditations as appropriate.","5":"Specifies solutions for use in learning and development programs in the workplace or in compulsory, further or higher education. Commissions the development of learning materials, allocates resources to learning teams, defines learning outcomes. Leads learning programs, recommends and specifies learning interventions for design, development and deployment according to agreed learning outcomes."},"description":"The specification, design, creation, packaging and maintenance of materials and resources for use in learning and development in the workplace or in compulsory, further or higher education. Typically involves the assimilation of information from existing sources, selection and re-presentation in a form suitable to the intended purpose and audience. Includes instructional design, content development, configuration and testing of learning environments, and use of appropriate current technologies such as audio, video, simulation and assessment. May include third party accreditation."},"Learning delivery":{"code":"ETDL","levels":{"3":"Delivers learning activities to a variety of audiences. Teaches, instructs,  trains students\/learners in order to develop knowledge, techniques and skills using appropriate methods, tools, online environments, equipment and materials. Oversees students\/learners in performing practical activities and work, advising and assisting where necessary. Provides detailed instruction where necessary and responds to questions, seeking advice in exceptional conditions beyond own experience. Assists with the development of examples and case study material for use within pre-defined learning material.","4":"Prepares or customises and delivers learning activities and the learning environment for a variety of audiences. Teaches, instructs, trains students\/learners in order to develop knowledge, techniques and skills using appropriate methods, tools, online environments, equipment and materials. Oversees students\/learners in performing practical activities and work, advising and assisting where necessary, and ensuring that maximum learning benefit is gained from the practical experience. Provides detailed instruction as necessary and responds to wide-ranging and detailed questioning in own area(s) of specialisation. Assesses objectively, against pre-set criteria, the ability levels of students and reports as appropriate. Develops examples and case study material for use in pre-defined courses. Adapts simple course material to meet the needs of students.","5":"Plans and schedules the delivery of learning activities, based on learning objectives. Manages the delivery of programmes of learning. Customises formal and informal learning activities, incorporating relevant business scenarios and case studies. Designs appropriate environments, and delivers learning activities to specialist audiences. Advises\/coaches others in learning delivery techniques and options."},"description":"The transfer of business and\/or technical skills and knowledge and the promotion of professional attitudes in order to facilitate learning and development. Uses a range of techniques, resources and media (which might include eLearning, on-line virtual environments, self-assessment, peer-assisted learning, simulation, and other current methods)."},"Teaching and subject formation":{"code":"TEAC","levels":{"5":"Delivers computing and IT curricula either in a formal educational context from primary through to tertiary level or in the workplace. Specialises in delivering Computing and IT education at the relevant educational level. Is aware of the techniques and methods used to evaluate and critique research in computing and IT education and applies good practice in learning content design, development and delivery.","6":"Leads specification, development and delivery of computing and IT curricula in either a formal educational context, from primary through to tertiary level or in the workplace. Specialises in the advanced aspects of delivering Computing and IT education at the relevant educational level. Uses current techniques and methods to evaluate and critique research in computing and IT education and leads the development of good practice in learning content design, development and delivery."},"description":"The specification, design, development, delivery and assessment of curricula for computing and for information technology (including electronic communication), at any level of the education system from primary through to tertiary (all age ranges) and in the workplace. The topics addressed are those of the fundamental and more advanced areas of computing and the common skills needed to make productive use of computers and IT systems for both computing and IT professionals and competent users of IT based systems including the ideas of computational thinking and the application of computational concepts to everyday and professional life. Special attention is paid to the methods, techniques and pedagogy (the study of being a teacher, tutor or lecturer, and the process of teaching) of computing & IT education."}},"People management":{"Performance management":{"code":"PEMT","levels":{"4":"Supervises individuals and teams. Allocates routine tasks and\/or project work. Provides direction, support and guidance as necessary, in line with individuals’ skills and abilities. Monitors progress against agreed quality and performance criteria. Acts to facilitate effective working relationships between team members.","5":"Manages individuals and groups. Allocates responsibilities and\/or packages of work, including supervisory responsibilities. Delegates responsibilities as appropriate. Sets performance targets, and monitors progress against agreed quality and performance criteria. Provides effective feedback, throughout the performance management cycle, to ensure optimum performance. Proactively works to ensure effective working relationships within the team and with those whom the team interacts with. Provides support and guidance as required, in line with individuals’ abilities. Advises individuals on career paths, and encourages pro-active development of skills and capabilities and provides mentoring to support professional development. Provides input in to formal processes such as compensation negotiations and disciplinary procedures.","6":"Manages senior individuals and groups. Determines and delegates management responsibilities. Sets performance objectives, and monitors progress against agreed quality and performance criteria. Initiates, develops and monitors effective performance management processes.  Sets the example for proactively building working relationships within the team, acting as an escalation point for staff and ensuring relationship challenges are addressed. Provides coaching and support and delegates responsibilities where possible, in order to achieve corporate objectives. Mentors and influences senior individuals in consideration of their career opportunities and contribution to the organisation. Leads on formal processes such as compensation negotiations and disciplinary procedures."},"description":"The optimisation of performance of people, including determination of capabilities, integration into teams, allocation of tasks, direction, support, guidance, motivation, and management of performance."},"Resourcing":{"code":"RESC","levels":{"4":"Implements resource plans, including conducting recruitment interviews. Facilitates selection, assessment and on-boarding processes, and internal resource allocation. Contributes to transitioning of resources, complying with relevant statutory or external regulations and codes of good practice.","5":"Develops plans to ensure that the organisation has appropriately skilled resources to meet organisational objectives and commitments. Manages the effective implementation of resource planning, recruitment, selection, assessment, on-boarding and transitioning of resources. Advises on standards, methods and tools for resource management. Ensures compliance with relevant statutory or external regulations and codes of good practice. Contributes to the development of resource management policies, standards and guidelines and to audits and assessment of resource management processes.","6":"Develops and communicates resource management policy, standards and guidelines in line with the organisation’s strategic human resource plans. Takes overall responsibility for resource planning, recruitment, selection, assessment, on-boarding and transitioning of resources. Leads the development of plans to ensure that the organisation has appropriately skilled resources to meet organisational objectives and commitments. Ensures that expert support is provided as required. Audits and assesses the ongoing success and effectiveness of resource management processes such as retention analysis, media and supplier assessment, customer satisfaction and validation of selection methods."},"description":"The overall resource management of the workforce to enable effective operation of the organisation. Provision of advice on any aspect of acquiring resources, including employees, consultants and contractors."},"Professional development":{"code":"PDSV","levels":{"4":"Maintains skills framework, or information about access to standard frameworks. Advises on required outcomes for learning or development, from knowledge of skills frameworks and organisational development needs. Assists practitioners with the process of creating development plans based on outcome statements. Monitors practitioners’ continuing professional development records, ensuring that achievements and enhanced capabilities are recorded and referenced to the outcome statements.","5":"Determines the required outcomes for learning or development, from organisational development needs training strategies, and agreed career pathways. Mentors assigned practitioners, ensuring alignment with predetermined statements of required development outcomes. Assists each practitioner with the creation of development plans based on the outcome statements. Ensures that each practitioner records evidence of continuing professional development. Validates practitioners’ records at the end of each cycle of planned development, to ensure that achievements and enhanced capabilities are correctly recorded and referenced to the outcome statements. May contribute to practitioners’ performance appraisals.","6":"Determines organisational development needs in line with business needs and strategic direction. Generates development strategies to achieve required change. Develops and leads communities of practice, including defining career pathways. Monitors progress and evaluates business benefits achieved from continual professional development."},"description":"The facilitation of the professional development of individuals, including initiation, monitoring, review and validation of learning and development plans in line with organisational or business requirements. The counselling of participants in all relevant aspects of their continual professional development. The identification of appropriate learning\/development resources. Liaison with internal and external training providers. The evaluation of the benefits of continual professional development activities."}},"Quality and conformance":{"Quality management":{"code":"QUMG","levels":{"3":"Uses appropriate methods and a systematic approach in the development, maintenance, control and distribution of quality and environmental standards. Makes technical changes to and controls the updates and distribution of quality standards. Distributes new and revised standards.","4":"Assists projects, functions or teams in planning the quality management for their area of responsibility.  Assists in the development of new or improved practices and organisational processes or standards. Facilitates localised improvements to the quality system or services.","5":"Advises on the application of appropriate quality management techniques and standards. Ensures that projects, teams and functions have appropriate practices in place and are meeting required organisational quality levels. Determines areas where existing processes should change from analysing audit findings. Takes responsibility for controlling updating and distributing organisational standards. Facilitates improvements to processes by changing approaches and working practices, typically using recognised models.","6":"Prioritises areas for quality improvement by considering  the strategy, wider business objectives and results from internal and external audits. Initiates the application of appropriate quality management techniques in these areas. Initiates improvements to processes by changing approaches and working practices, typically using recognised models. Achieves and maintains compliance against national and international standards, as appropriate. Identifies and plans systematic corrective action to reduce errors and improve the quality of the systems and services, by examination of the root causes of problems.","7":"Sets the quality strategy and policies for approval and adoption by organisational management and secures commitment to it from executive leadership. Determines the extent to which the quality policy meets the organisation’s needs and objectives and reviews it as necessary. Establishes an organisational quality management system that delivers the quality strategy. Plans, resources and monitors the performance of the quality management system and an internal quality audit schedule. Defines and reviews quality systems. Ensures that adequate technology, procedures and resources are in place to support the quality system."},"description":"Quality management establishes within an organisation a culture of quality and a system of processes and working practices to deliver the organisation’s quality objectives. This involves the  application of techniques for the monitoring and improvement of the quality of any aspect of a function, processes, products, services or data. The achievement of, and maintenance of compliance to, national and international standards, as appropriate, and to internal policies, including those relating to quality, service, sustainability and security."},"Quality assurance":{"code":"QUAS","levels":{"3":"Contributes to the collection of evidence and the conduct of formal audits or reviews of activities, processes, data, products or services. Examines records for evidence that appropriate testing and other quality control activities have taken place and determines compliance with organisational directives, standards and procedures. Identifies non-compliances, non-conformances and abnormal occurrences.","4":"Conducts formal audits or reviews to ensure compliance with organisational standards for activities, processes, data, products or services. For projects, development or support activities; plans, organises and conducts audits and determines whether appropriate quality control has been applied. Collates, collects and examines records, analyses the evidence and drafts all or part of formal compliance reports. Determines the risks associated with findings and non-compliance and proposes corrective actions. Provides advice and guidance in the use of organisational standards. Performs  quality assurance reviews of suppliers and throughout the supply chain.","5":"Plans, organises and conducts formal independent audits of complex projects, major programmes or functional areas. Evaluates, appraises and identifies non-compliances with organisational standards, and determines whether appropriate quality control has been applied. Prepares and reports audit findings and determines the risks associated with those findings and ensures that corrective actions are carried out. Reviews and analyses audit reports to identify common areas of non-compliance and identifies opportunities to improve the effectiveness and efficiency of the organisational control mechanisms. Performs  audits throughout the supply chain. Plans and oversees the assurance activities of others.","6":"Leads, develops and is accountable for an organisational approach and commitment to quality assurance. Ensures that quality assurance processes and activities are robust and based on industry best practice. Considers the implications of emerging technology, approaches, trends, regulations and legislation. Plans and resources the organisational quality assurance activities. Monitors and reports on quality assurance activities, levels of compliance and both organisational and project risks. Reviews and analyses results from audit activities and identifies improvement opportunities for the organisation."},"description":"The process of ensuring, through independent assessment and review, that appropriate working practices, quality control activities, organisational processes and quality standards are in place and adhered to and that best practices are promoted throughout the organisation. Quality assurance provides confidence to internal management and external bodies, such as customers or regulators, that quality requirements will be fulfilled. Quality assurance may relate to any area where quality standards are applied, including products, data, services and business processes."},"Measurement":{"code":"MEAS","levels":{"3":"Applies standard techniques to support the specification of measures and the collection and maintenance of data for measurement. Generates, produces and distributes reports. Uses measurement tools for routine analysis of data. Identifies and implements improvements to data collection methods.","4":"Supports projects, functions or teams in the development of project and\/or operational methods for measurement. Specifies base and derived measures which support agreed information needs. Identifies and prioritises appropriate measures, scales, and targets. Specifies how to collect and store the data for each required measure. Provides guidance on collection of data including automation. Designs reports and reporting formats.","5":"Provides advice and guidance for effective use of measures and measurement. Establishes measurement objectives and the scope of measurement for functions, teams and projects. Plans and implements improvements to measurement capability. Selects measures appropriate to the context and organisational objectives. Contributes to organisational policies, standards, and guidelines for measurement. Reviews data collection and storage mechanisms (including automation) to support measurement.","6":"Creates the measurement framework and aligns measurement objectives with business objectives. Develops organisational policies, standards, guidelines for measurement. Leads the development of organisational capabilities for measurement (including automation). Provides resources to ensure adoption and adherence to policies and standards."},"description":"The development and operation of a measurement capability to support agreed organisational information needs. The planning, implementation, and control of activities to measure attributes of processes, products, and services in order to assess performance, progress, and provide indications and insights to actual or potential problems, issues, and risks. The identification of requirements, selecting measures and measurement scales, establishing data collection and analysis methods, setting target values and thresholds. Measurement can be applied to organizations, projects, processes, and work products."},"Conformance review":{"code":"CORE","levels":{"3":"Collects and collates evidence as part of a formally conducted and planned review of activities, processes, products or services. Examines records as part of specified testing strategies for evidence of compliance with management directives, or the identification of abnormal occurrences.","4":"Conducts formal reviews of activities, processes, products or services. Collects, collates and examines records as part of specified testing strategies for evidence of compliance with management directives, or the identification of abnormal occurrences. Analyses evidence collated and drafts part or all of formal reports commenting on the conformance found to exist in the reviewed part of an information systems environment.","5":"Plans formal reviews of activities, processes, products or services. Evaluates and independently appraises the internal control of processes, based on investigative evidence and assessments undertaken by self or team. Ensures that independent appraisals follow agreed procedure and advises others on the review process. Provides advice to management on ways of improving the effectiveness and efficiency of their control mechanisms. Identifies and evaluates associated risks and how they can be reduced.","6":"Specifies organisational procedures for the internal or third-party assessment of an activity, process, product or service, against recognised criteria. Develops plans for review of management systems, including the review of implementation and use of standards and the effectiveness of operational and process controls. May manage the review, conduct the review or manage third party reviewers. Identifies areas of risk and specifies interrogation programs. Recommends improvements in processes and control procedures. Authorises the issue of formal reports to management on the extent of compliance of systems with standards, regulations and\/or legislation."},"description":"The independent assessment of the conformity of any activity, process, deliverable, product or service to the criteria of specified standards, best practice, or other documented requirements. May relate to, for example, asset management, network security tools, firewalls and internet security, sustainability, real-time systems, application design and specific certifications."},"Safety assessment":{"code":"SFAS","levels":{"5":"Participates in assessments up to IEC 61508 Safety Integrity level 3 (or equivalent standard), and undertakes safety analyses on initial designs using HAZOPS, FMEA or similar methods.","6":"Leads assessments up to IEC 61508 Safety Integrity level 4 (or equivalent standard) or participates in any level of assessment. Determines assessment methods, techniques and tools that are to be used as appropriate to the integrity levels of the assessments undertaken."},"description":"The assessment of safety-related software systems to determine compliance with standards and required levels of safety integrity. This involves making professional judgements on software engineering approaches, including the suitability of design, testing, and validation and verification methods, as well as the identification and evaluation of risks and the means by which they can be reduced. The establishment, maintenance and management of an assessment framework and practices."},"Digital forensics":{"code":"DGFS","levels":{"4":"Contributes to digital forensic investigations. Processes and analyses evidence in line with policy, standards and guidelines and supports production of forensics findings and reports.","5":"Conducts investigations to correctly gather, analyse and present the totality of findings including digital evidence to both business and legal audiences. Collates conclusions and recommendations and presents forensics findings to stakeholders. Contributes to the development of policies, standards and guidelines.","6":"Sets policies and standards and guidelines for how the organisation conducts digital forensic investigations. Leads and manages complex investigations engaging additional specialists if required. Authorises the release of formal forensics reports."},"description":"The collection, processing, preserving, analysis, and presentation of forensic evidence based on the totality of findings including computer-related evidence in support of security vulnerability mitigation and\/or criminal, fraud, counterintelligence, or law enforcement investigations."}}},"Relationships and engagement":{"Stakeholder management":{"Sourcing":{"code":"SORC","levels":{"2":"Assists in preparation of pre-qualification questionnaires and tender invitations in response to business cases. Assembles relevant  information for tenders. Produces detailed evaluation criteria for simple tender criteria. Assists in evaluation of tenders.","3":"Prepares pre-qualification questionnaires and tender invitations in response to business cases. Recognises the difference between open source and proprietary systems options. Produces detailed evaluation criteria for more complex tenders and assists in evaluation of tenders.","4":"Reviews business cases (requirements, potential benefits and options) and determines appropriate procurement routes, for example, open market or collaborative framework. Using market knowledge to inform specifications, ensures detailed pre-qualification questionnaires and tender invitations are prepared. Collects and collates data to support collaboration and negotiates terms and conditions to reflect the scale of requirements and encourage good performance. Evaluates tenders based on specification and evaluation criteria, prepares acceptance documentation and advises on contracts and service level agreements.","5":"Researches suppliers and markets, and maintains a broad understanding of the commercial environment, to inform and develop commercial strategies and sourcing plans. Advises on the business case for alternative sourcing models, and on policy and procedures covering the selection of suppliers, tendering, and procurement. Leads procurement teams, managing tender, evaluation and acquisition processes. Negotiates with potential partners and suppliers, developing acceptance criteria and procedures. Drafts and places contracts.","6":"Influences policy and procedures covering the selection of suppliers, tendering, procurement and benchmarking. Establishes procurement strategies, standards, methods, processes and good practices that ensure compliance with legislation, regulation and third-party information security. Identifies external partners, engaging with professionals in other related disciplines as appropriate. Ensures that terms and conditions are aligned with current legislation and policy. Leads the procurement process, from clarifying requirements through to placing, monitoring and terminating contracts.","7":"Takes overall responsibility for conformance to legislation; supply chain management; commercial governance; policy and procedures for selection of suppliers, tendering and procurement (including \"build or buy\" criteria, and benchmarking performance). Determines overall strategies for managing supplier relationships, embracing effective operational relationships at all levels. Is responsible for deployment and review of acquisition processes and for negotiating major contracts."},"description":"The provision of policy, internal standards and advice on the procurement or commissioning of externally supplied and internally developed products and services. The provision of commercial governance, conformance to legislation and assurance of information security. The implementation of compliant procurement processes, taking full account of the issues and imperatives of both the commissioning and supplier sides. The identification and management of suppliers to ensure successful delivery of products and services required by the business."},"Supplier management":{"code":"SUPP","levels":{"2":"Assists in the collection and reporting on supplier performance data. Assists with the routine day-to-day communication between the organisation and suppliers.","3":"Acts as the routine contact point between the organisation and suppliers. Supports resolution of supplier related incidents, problems, or unsatisfactory performance. Collects and reports on supplier performance data.","4":"Collects supplier performance data and investigates problems. Monitors and reports on supplier performance, customer satisfaction, and market intelligence. Validates that suppliers’ performance is in accordance with contract terms. Engages proactively and collaboratively with suppliers to resolve incidents, problems, or unsatisfactory performance. Implements supplier management-related service improvement initiatives and programmes.","5":"Manages suppliers to meet key performance indicators and agreed targets. Manages implementation of supplier service improvement actions. Use suppliers’ expertise to support and inform development roadmaps. Manages operational relationships between suppliers. Ensures potential disputes or conflicts  are raised at an early stage, with clear escalation paths for resolving them. Performs bench-marking and makes use of supplier performance data to ensure that supplier performance is properly monitored and regularly reviewed. Identifies constraints and opportunities when negotiating or renegotiating contracts.","6":"Develops organisational policies, standards, and guidelines to ensure effective supplier management across the integrated supply chain. Defines the approach for commercial communications, and the management and maintenance of the relationship between the organisation and suppliers. Creates an environment in which the organisation and its suppliers collaborate to their mutual benefit, ensuring positive and effective working relationships are developed and maintained across the supply chain. Ensures that resources and tools are in place to conduct bench-marking. Reviews supplier analysis and assesses effectiveness across the supply chain. Assures that the quality of the services delivered by suppliers meet contractual commitments and business needs. Manages risks associated with information security, continuity and integrity of supply.","7":"Determines overall supplier management strategy, embracing effective management and operational relationships at all levels. Leads collaborative supplier partnerships that reduce costs and risks, and create opportunities for innovation and value creation. Aligns supplier performance objectives and relationship management activities with business and commercial objectives and sourcing strategies. Establishes a framework to monitor the service provided and deliver commercial value over the lifetime of the contract. Puts in place, and has overall responsibility for, conformance to legislation; supply chain management; commercial governance; risk management policies for selection of suppliers and bench-marking their performance. Represents the organisation in commercially significant disputes involving suppliers."},"description":"The alignment of an organisation’s supplier performance objectives and activities with sourcing strategies and plans, balancing costs, efficiencies and service quality. The establishment of working relationships based on collaboration, trust, and open communication in order to encourage co-innovation and service improvement with suppliers. The proactive engagement of suppliers for mutual benefit to resolve operational incidents, problems, poor performance and other sources of conflict. The use of clear escalation paths for discussing and resolving issues. The management of performance and risks across multiple suppliers (internal and external) using a set of agreed metrics."},"Contract management":{"code":"ITCM","levels":{"4":"Sources and collects contract performance data (such as pricing and supply chain costs), and monitors performance against KPIs.  Identifies and reports under-performance and develops opportunities for improvement. Monitors compliance with Terms and Conditions and take appropriate steps to address non-compliance. Pro-actively manages risk and reward mechanisms in the contract. Monitors progress against business objectives specified in the business case. Identifies where change is required, and plans for variations. In consultation with stakeholders, ensures that change management protocols are implemented.","5":"Oversees and measures the fulfillment of contractual obligations. Uses key performance indicators (KPIs) to monitor and challenge performance and identify opportunities for continuous improvement. Develops strategies to address under-performance and compliance failures, including application of contract terms. Identifies where changes are required, evaluates the impact, and advises stakeholders about the implications and consequences for the business and\/or the procurement element of programmes\/projects. Negotiates variations and seeks appropriate authorisation. Actively supports and engages with experts and stakeholders to ensure continuous improvements are identified through review and benchmarking processes. Develops and implements change management protocols.","6":"Negotiates and resolves contractual issues, including failure to meet contractual obligations. Promotes change control processes and leads variation negotiations when necessary. Champions continuous improvement programmes, jointly developing strategies and incentives to enhance performance. Undertakes comprehensive financial evaluations. Ensures non-discriminatory behaviour and legal compliance. Ensures that lessons learned from reviews are documented and promoted with all stakeholders. Develops broad industry\/ category credentials as ‘best practice’ champion."},"description":"The overall management and control of the operation of formal contracts for supply of products and services."},"Relationship management":{"code":"RLMT","levels":{"4":"Implements stakeholder engagement\/communications plan. Deals with problems and issues, managing resolutions, corrective actions, lessons learned and the collection and dissemination of relevant information. Collects and uses feedback from customers and stakeholders to help measure effectiveness of stakeholder management. Helps develop and enhance customer and stakeholder relationships.","5":"Identifies the communications and relationship needs of stakeholder groups. Translates communications\/stakeholder engagement strategies into specific activities and deliverables. Facilitates open communication and discussion between stakeholders, acting as a single point of contact by developing, maintaining and working to stakeholder engagement strategies and plans.  Provides informed feedback to assess and promote understanding. Facilitates business decision-making processes. Captures and disseminates technical and business information.","6":"Leads the development of comprehensive stakeholder management strategies and plans. Builds long-term, strategic relationships with senior stakeholders (internal and external). Facilitates the engagement of stakeholders  and delivery of services and change projects, acting as a single point of contact for senior stakeholders, facilitating relationships between them. Negotiates to ensure that stakeholders understand and agree what will meet their needs, and that appropriate agreements are defined. Oversees monitoring of relationships including lessons learned and appropriate feedback. Leads actions to improve relations and open communications with and between stakeholders.","7":"Determines the strategic approach to understanding stakeholder objectives and requirements. Works with all interested parties to establish effective relationships between stakeholders, including responsibility for the relationship between technology functions and end users. Establishes and promotes the overall vision for how stakeholder objectives are met and determines organisational roles and alignment. Actively manages relationships with the most senior stakeholders, and is the ultimate escalation point for issue resolution. Defines, and gains agreement on, the principles for establishing effective relationships between stakeholders, including responsibility for the relationship between IT functions and end users."},"description":"The systematic identification, analysis, management, monitoring and improvement of stakeholder relationships in order to target and improve mutually beneficial outcomes. Gains commitment to action through consultation and consideration of impacts. Design the relationship management approach to be taken; including roles and responsibilities, governance, policies, processes, and tools, and  support mechanisms. Creatively combines formal and informal communication channels in order to achieve the desired result."},"Customer service support":{"code":"CSMG","levels":{"1":"Receives and handles requests for service, following agreed procedures. Promptly allocates calls as appropriate. Logs incidents and service requests and maintains relevant records.","2":"Responds to common requests for service by providing information to enable fulfilment. Promptly allocates unresolved calls as appropriate. Maintains records, informs users about the process and advises relevant persons of actions taken.","3":"Acts as the routine contact point, receiving and handling requests for support. Responds to a broad range of service requests for support by providing information to fulfill requests or enable resolution. Provides first line investigation and diagnosis and promptly allocates unresolved issues as appropriate. Assists with the development of standards, and applies these to track, monitor, report, resolve or escalate issues. Contributes to creation of support documentation.","4":"Monitors service delivery channels human, digital, self-service, automated) and collects performance data. Assists with the specification, development, research and evaluation of services standards. Applies these standards to resolve or escalate issues and gives technical briefings to staff members.","5":"Responsible for day-to-day management, resource planning and work allocation to meet agreed service levels. Specifies, agrees and applies standards. Ensures that tracking and monitoring of performance of service delivery through all channels (human, digital, self-service, automated) is carried out, metrics and reports are analysed, and issues are resolved. Drafts and maintains policy, standards and procedures for the customer service or service desk functions. Ensures that the catalogue of requestable and supported  services is complete and current.","6":"Influences the strategic direction and takes responsibility for the full range of customer service functions, including organisational frameworks for complaints, service standards and operational agreements. Defines service channels, service levels, standards and the monitoring process for customer service or service desk staff. Provides leadership to deliver the service culture required to deliver required organisational outcomes. Takes responsibility for business continuity and legal, regulatory, and contractual compliance."},"description":"The management and operation of one or more customer service or service desk functions. Acting as a point of contact to support service users and customers reporting issues, requesting information, access, or other services. The delivery of customer service through multiple channels  including human, digital, self-service and automated."}},"Sales and marketing":{"Marketing":{"code":"MKTG","levels":{"2":"Understands the basic principles of marketing, and tools used by the organisation for planning, implementing and monitoring marketing activities. Collects and monitors results of marketing activities. Assists in market research and data collection providing summary reports of their findings.","3":"Leverages market research materials, customer and employee insights and other sources, to identify industry trends, needs and opportunities. Selects from and uses marketing tools appropriate to the allocated assignment. Conducts market research, and maintains relevant information, including lessons learned from previous campaigns, and effectiveness measures for current and previous activities. Contributes to marketing plans, identifying and articulating unique selling points and key messages for marketing material. Presents and communicates at marketing events.","4":"Plans and conducts market research to investigate and further understand customer and competitor dynamics, using appropriate channels and tools to engage with the desired audience(s). Uses research and lessons learned to inform marketing plans, including planning for customer loyalty. Creates unique selling points, and key messages for marketing material. Makes creative use of elements relevant to both digital and traditional environments, and drafts appropriate support materials. Analyses the effectiveness of campaigns and services and their impact on audience behaviour and business outcomes. Organises and participates actively in marketing events.","5":"Devises and manages marketing campaigns within specified budgets to meet specified objectives. Manages and monitors market research, analysis and the marketing planning process.  Advises on brand management and promotion of corporate reputation, and plays an active role in promoting engagement of staff and business partners. Takes overall responsibility for the production of marketing materials and staging of events. Finds innovative solutions to marketing problems. Uses experience and data to make informed recommendations to senior management, including market segmentation and customer loyalty. Reviews and reports on the effectiveness of marketing approaches and services and their impact on business outcomes.","6":"Determines and oversees the overall marketing strategy for the organisation to meet its business objectives. Provides oversight of all marketing plans and directs the marketing planning process. Evaluates and responds to key factors relating to the implementation, measurement and review of successful campaigns, including assessing the current and future capability needed by the marketing function, the role of staff engagement and business partners, and the appropriate mix of marketing activities and channels."},"description":"The research, analysis and stimulation of potential or existing markets for IT and related products and services, both to provide a sound basis for business development and to generate a satisfactory flow of customer enquiries. The management and development of strategies, campaigns and day-to-day marketing activity delivered through appropriate channels"},"Selling":{"code":"SALE","levels":{"4":"Collects and uses information in order to achieve sales objectives. Responds to existing sales leads and identifies and qualifies new leads and prospects with a view to developing a pipeline of potential opportunities. Understands customer and needs, and develops and enhances customer relationships, before, during and after the conclusion of agreements\/contracts. Key tasks may also include bid management, value analysis, negotiation, presentation and preparation of contracts. Monitors and reports on quota, performance, customer satisfaction, market intelligence and competitors.","5":"Designs and implements sales strategies and works with senior management to implement sales plans. Plans, monitors and controls the work of sales teams. Develops and maintains effective customer relationships at executive levels and qualifies new sales leads. Leads the bid process within the organisation. Agrees and signs contracts. Maintains customer contact during and after the selling process to pre-empt any issues and identify further opportunities. Contributes to the development and training of sales teams and product\/service development.","6":"Oversees the organisation’s sales activities to ensure they are aligned with corporate business objectives (organisation may be a division of a larger enterprise). Approves sales proposals and targets. Negotiates with customer representatives at the most senior level on both technical and contractual issues. Agrees and signs contracts. Develops and implements organisational sales policy and strategy, and contributes significantly to the development of marketing strategy. Initiates, with Marketing, evolution of services, products systems, and standard contracts to support alignment with future customer needs."},"description":"The identification of sales prospects and their qualification, the development of customer interest and the preparation (including managing the bid process), execution and monitoring of the sale of any product or service into an external or internal market."},"Sales support":{"code":"SSUP","levels":{"1":"Able to communicate effectively with customers by telephone and provide information about products and services. Seeks assistance from colleagues for the resolution of more complex customer service queries and complaints. Can use databases to retrieve and enter data.","2":"Communicates effectively with customers by telephone and in person. Assists in the provision of customer service, including technical advice and guidance on matters bearing on the successful use of products and services. Assists in devising solutions to customer requirements and solves straightforward problems.","3":"Provides customer service, including technical advice and guidance on all matters bearing on the successful use of complex products and services. Helps customers to clarify their requirements; documents the conclusions reached, and contributes to preparing and supporting bids and sales proposals.","4":"Works closely with the sales team to help prospects to clarify their needs and requirements; devises solutions and assesses their feasibility and practicality. Demonstrates technical feasibility using physical or simulation models. Produces estimates of cost and risk and initial project plans to inform sales proposals. Resolves technical problems.","5":"Works closely with the sales team to ensure that customers are assisted and advised properly. Ensures that reliable cost, effort and risk estimates and project plans are produced. Manages all sales support activities, taking full responsibility for the technical content of bids and sales proposals. Establishes metrics to provide data on performance and help with the continuous improvement of sales support activities.","6":"Leads the organisation’s customer service activities to ensure that they are aligned with corporate objectives and policy. Approves proposals and initiates the implementation of development activity in customer services and systems."},"description":"The provision of technical advice and assistance to the sales force, sales agents, reseller\/distributor staff and existing or prospective customers, either in support of customer development or sales activity or in fulfilment of sales obligations."},"Product management":{"code":"PROD","levels":{"3":"Applies standard techniques and tools to carry out analysis and performance monitoring activities for specified products. Supports problem resolution, resolves issues and acts on feedback and usage of in-life products. Creates product collateral and monitors results and feedback from product campaigns.","4":"Manages aspects of the product lifecycle enabling the product to meet the needs of customers\/users and achieve financial or other targets. Acts as product owner for one or more lower-value products or services; prioritises product requirements and owns a product backlog. Analyses market and\/or user research, feedback, expert opinion and usage data to understand needs and opportunities. Facilitates uptake of products by planning development of product collateral, supporting and evaluating campaigns, and monitoring product performance. Rolls out product trials and product launches.","5":"Manages the full product lifecycle to ensure that, over time, the needs of customers\/users continue to be met and that financial and other benefits are achieved. Acts as owner\/champion for one or more products or services. Selects, adopts and adapts appropriate product development methods, tools, and techniques selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches. Analyses market and\/or user research, feedback, expert opinion and usage data to understand needs and opportunities. Develops product propositions and determines product positioning and variants for different customer and user segments. Prioritises product requirements and owns the product backlog. Coordinates trials and product launches and supports  communications and training. Anticipates changes in customer\/user needs; adapts products, and creates product retirement and transitioning plans.","6":"Creates the product lifecycle management framework for internal and external customers and users. Champions the importance and value of product management principles and appropriate product development models whether predictive (plan-driven) approaches or more adaptive (iterative\/agile) approaches. Aligns the product management objectives with business objectives, and authorises the selection and planning of all product management activities. Initiates creation of new products. Oversees the organisation’s suite of products and accountable for delivery of customer value and\/or user satisfaction over time. Identifies how new products may create new opportunities and how to adapt existing products to create new opportunities."},"description":"The active management of products or services throughout their lifecycle (inception through to retirement) in order to address market opportunities and customer\/user needs and generate the greatest possible value for the business. The adoption and adaptation of product development models based on the context of the work and selecting appropriately from predictive (plan-driven) approaches or adaptive (iterative\/agile) approaches."}}}}
